/****************************************Copyright (c)****************************************************
**                  
**                                      
**                                 
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               DateTime.h
** Latest modified Date:    2015-05-25
** Latest Version:          1.0.0
** Descriptions:            日期时间设置菜单页头文件
**
**--------------------------------------------------------------------------------------------------------
** Created by:              
** Created date:            2015-05-25
** Version:                 1.0.0
** Descriptions:            The original version
**--------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
** Version:                 
** Descriptions:            
**
*********************************************************************************************************/
#ifndef __DATE_TIME_H
#define __DATE_TIME_H

#ifdef __cplusplus
extern "C" {
#endif                                                                  /*  __cplusplus                 */

/*********************************************************************************************************
** Function name:           miDateTimeInit
** Descriptions:            日期时间设置菜单页初始化
** input parameters:        none
** output parameters:       none
** Returned value:          none
*********************************************************************************************************/
extern void miDateTimeInit(void);

/*********************************************************************************************************
** Function name:           miDateTimeDel
** Descriptions:            日期时间设置菜单页卸载
** input parameters:        none
** output parameters:       none
** Returned value:          none
*********************************************************************************************************/
extern void miDateTimeDel(void);

#ifdef __cplusplus
}
#endif                                                                  /*  __cplusplus                 */

#endif                                                                  /*  __DATE_TIME_H               */

/*********************************************************************************************************
  END FILE
*********************************************************************************************************/
