/****************************************Copyright (c)****************************************************
**                      Beijing Huatai Industrial Equipment Co.,Ltd.
**                                      
**                                 http://www.huatai.com.cn 
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               Nbr.h
** Latest modified Date:    2021-12-27
** Latest Version:          1.0.0
** Descriptions:            邻架控制菜单项头文件
**
**--------------------------------------------------------------------------------------------------------
** Created by:              超人力霸王
** Created date:            2021-12-27
** Version:                 1.0.0
** Descriptions:            The original version
**--------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
** Version:                 
** Descriptions:            
**
*********************************************************************************************************/
#ifndef __NBR_H
#define __NBR_H

#ifdef __cplusplus
extern "C" {
#endif                                                                  /*  __cplusplus                 */


/*********************************************************************************************************
** Function name:           miNbrInit
** Descriptions:            邻架控制菜单项初始化
** input parameters:        none
** output parameters:       none
** Returned value:          none
*********************************************************************************************************/
extern void miNbrInit(void);

/*********************************************************************************************************
** Function name:           miNbrDel
** Descriptions:            邻架控制菜单项卸载
** input parameters:        none
** output parameters:       none
** Returned value:          none
*********************************************************************************************************/
extern void miNbrDel(void);

#ifdef __cplusplus
}
#endif                                                                  /*  __cplusplus                 */

#endif                                                                  /*  __NBR_H                     */

/*********************************************************************************************************
  END FILE
*********************************************************************************************************/
