/****************************************Copyright (c)****************************************************
**                  
**                                      
**                                 
**
**--------------File Info---------------------------------------------------------------------------------
** File name:           eeprom.c
** Last modified Date:  2017-05-30
** Last Version:        1.0
** Descriptions:        
**--------------------------------------------------------------------------------------------------------
** Created by:          
** Created date:        2017-07-30
** Version:             1.0
** Descriptions:        The original version
**
**--------------------------------------------------------------------------------------------------------
** Modified by:         
** Modified date:       
** Version:             
** Descriptions:        
**
*********************************************************************************************************/
#include  "..\main.h" 

#define   __FM31L274_E  0xA0                                            /* 定义器件地址                 */

/*********************************************************************************************************
** Function name:       write_eeprom
** Descriptions:        写EEPROM
** input parameters:    usSubAddr   : 从机内部子地址
**                      pucRet      : 指向返回数据存储位置的指针
**                      ulSize      : 数据长度
** output parameters:   None
** Returned value:      None
**--------------------------------------------------------------------------------------------------------
*********************************************************************************************************/
INT8U  eepromWrite (INT16U usSubAddr, INT8U *pucRet, INT32U ulSize)
{ 
    INT8U  ucSubAddr[2];                                                
    INT8U  ucAck;
    ucSubAddr[0] = (usSubAddr >> 8) & 0xFF;
    ucSubAddr[1] = usSubAddr & 0xFF;
    
    i2cWrite(I2C0, __FM31L274_E, ucSubAddr, 2, pucRet, ulSize, NULL);       
    do {
        OSTimeDly(1);
        ucAck = i2cGetFlag(I2C0);
        if (((I2C_NOT_GET_BUS | I2C_ACK_ERR) & ucAck) != 0) {
            break;
        }
    } while((I2C_WRITE_END & ucAck) == 0);
    return ucAck;
}

/*********************************************************************************************************
** Function name:       read_eeprom
** Descriptions:        读EEPROM
** input parameters:    usSubAddr   : 从机内部子地址
**                      pucRet      : 指向返回数据存储位置的指针
**                      ulSize      : 数据长度
** output parameters:   None
** Returned value:      None
**--------------------------------------------------------------------------------------------------------
*********************************************************************************************************/
uint8  eepromRead (INT16U usSubAddr, INT8U *pucRet, INT32U ulSize)
{    
    INT8U  ucSubAddr[2];                                                
    INT8U  ucAck;
    ucSubAddr[0] = (usSubAddr >> 8) & 0xFF;
    ucSubAddr[1] = usSubAddr & 0xFF;
    
    i2cRead(I2C0, __FM31L274_E, ucSubAddr, 2, pucRet, ulSize,NULL);         
    do {
        OSTimeDly(1);
        ucAck = i2cGetFlag(I2C0);
        if (((I2C_NOT_GET_BUS | I2C_ACK_ERR) & ucAck) != 0) {
            break;
        }
    }while((I2C_READ_END & ucAck) == 0);
    return ucAck;
}
                  
/*
     *  参数的默认初始化值
     */
const INT8U __GucParaDefault[512] =  
{
   0x01, 0x00,          //0,1-最大架号 
   0x0A, 0x00,          //2,3-最小架号                              
   0xFA, 0x00,          //4,5-主控时间 
   0x96, 0x00,          //6,7-补压下限   
   0x96, 0x00,          //8,9-补压上限 
   0xc8, 0x00,          //10,11-初撑力 
   0x28,                //12
   0x28, 0x00,          //13,14-补压间隔 
   0x00,                //15跟机参数初始化
   0x00,                //16-倾角校正 bit0：0-关，1-开
   0x01,                //17-补压次数
   0x01, 0x00,          //18,19-停止范围  
   0xff, 0xff,          //20,21-自动移架动作开关  
   0x00,                //22-
   0x00,                //23-
   0xff,                //24-bit0，0:右向增量 1:左向增量;
                        //  -bit1，0：网络变换器与控制器的右端口连接；1：网络变换器与控制器的左端口连接?
                        //  -bit2,收伸缩梁降柱是否允许，1-允许，0-禁止
						//  -bit4，0-动作数据不报；1-动作数据上传
                        //  -bit5, 0-煤机位置不上传；1-煤机位置上传
                        //  -bit7, 0-无网络变换器，1-有网络变换器

   0x04, 0x00,          //25,26-支架网络编号  
   0x01,                //27-电源组编号  
   0x01, 0x00,          //28,29-后柱补压目标压力   
   0xff,                //30-   网络变换器启动跟机
   0x01, 0x00,          //31,32-跟机首架支架编号 
   0x01, 0x00,          //33,34-跟机末架支架编号 
   0x00,                //35-   跟机开关设置
   0x01,                //36-   移架距离
   0x01,                //37-   推溜距离
   0x01,                //38-   伸缩梁收进距离
   0x01,                //39-   伸缩梁伸出距离
   0x00,                //40-跟机喷雾距离
   0x00,                //41-跟机喷雾范围
   0x01,               //42-上行蛇形大号
   0x01,               //43-上行蛇形小号
   0x01,               //44-上行清浮煤大号
   0x01,               //45-上行清浮煤小号
   0x01,               //46-上行清浮煤补充触发点
   0x01,               //47-下行蛇形大号
   0x01,               //48-   煤机限制
   0x01,               //49下行蛇形小号
   0x01,               //50下行清浮煤大号
   0x01,               //51下行清浮煤小号
   0x01,               //52下行段补充自动移架推溜触发点
   0x01,               //53自动跟机方向1-下行2-上行
   0x01,               //54自动跟机阶段设置参数
   0x01,               //55大号架顺序移架点
   0x01,               //56大号架顺序移架触发
   0x01,               //57小号架顺序移架点
   0x01,               //58小号架顺序移架触发
   0x01,                //59-   煤机身长
   0x00,                //60- 开关设置
   0x00, 0x00,          //61,62-包括ASQ_STREB_LOW,***_ADV;***_SET;ASQ_SEAL_LOW;***_ADV; ASQ_WARN;ASQ_NB;ASQ_FLIP;ASQ_PRELOW;ASQ_LIFT_F;ASQ_RELOW_F
   0x03,                //63-   成组移架范围
   0x03, 0x00,          //64,65-报警时间 
   0x96, 0x00,          //66,67-移架压力
   0xc8, 0x00,          //68,69-过渡压力 
   0xfa, 0x00,          //70,71-支撑压力
   0xfa, 0x00,          //72,73- 
   0xfa, 0x00,          //74,75-等待时间 
   0x96, 0x00,          //76,77-目标行程 
   0x03,                //78成组推后溜动作范围
   0x01,                //79成组推后溜动作组
   0x0a,                //80成组推后溜动作时间
   0x00,                //81成组推后溜启动间隔
   0x1e,                //82-   预降柱时间
   0x1e,                //83-   P0降时间
   0x1e,                //84-   再次降柱时间
   0x00,                //85-抬底开始时间
   0x00,                 //86-抬底时间
   0x1e, 0x00,           //87,88-移架时间 
   0x1e,                 //89-   再降柱时间
   0x1e,                 //90-   再移架时间
   0x00,                 //91-   再降柱次数
   0x1e,                 //92-   升柱时间1
   0x1e,                 //93-   升柱时间2
   0x01,                 //94-工作面控制器启动跟机
   0x00,                 //95-   启动间隔
   0x1e,0x00,            //96,97-助推行程
   0x03,                 //98-     动作范围
   0x01,                 //99-     动作组
   0x96,0x00,            //100，101移架压力（后柱）
   0x1e,0x00,            //102,103-动作时间
   0x0a,0x00,            //104,105-组间延迟 
   0x00,                 //106-    启动间隔 
   0x1e,0x00,            //107,108-最大差值
   0x1e,                 //109预升柱动作时间
   0x00,                 //110-未用
   0x32,0x00,            //111,112-目标行程  
   0x1f,0x04,            //113,114-本架推溜时间 
   0x3e,0x08,            //115,116-推溜保护  
   0x00,                 //117-    允许升柱
   0x96,0x00,            //118,119-允许压力  
   0x03,                 //120成组拉后溜动作范围
   0x01,                 //121成组拉后溜动作组
   0x1e,0x00,            //122，123成组拉后溜动作时间  
   0x0a,                 //124成组拉后溜组间延迟
   0x00,                 //125成组拉后溜启动间隔
   0x1f,0x04,            //126，127本架拉后溜动作时间      
   0x03,                 //128成组护帮动作范围
   0x0a,                 //129成组护帮架间延迟
   0x0a,                 //130成组收伸缩梁动作时间动作时间
   0x0a,                 //131成组伸伸缩梁动作时间动作时间
   0x0a, 				 //132成组伸护帮板	动作时间
   0x0a,                 //133成组收护帮板	动作时间 
   0x00,                 //134联动及自动移架一级护帮收开始动作时间
   0x0a,                 //135联动及自动移架一级护帮收动作时间
   0x0a,                 //136联动及自动移架伸缩梁收开始动作时间
   0x0a,                 //137联动及自动移架伸缩梁收动作时间                                       //
   0x0a,       	         //138联动及自动移架一级护帮伸开始动作时间
   0x0a,                 //139联动及自动移架一级护帮伸动作时间
   0x0a,  				 //140联动及自动移架伸缩梁伸开始动作时间
   0x0a,                 //141联动及自动移架伸缩梁伸动作时间
   0x00,                 //142收伸缩梁动作时降柱时间
   0x00,                 //143  
   0x03,                 //144-动作范围
   0x01,                 //145-动作组
   0x0a,0x00,            //146,147-拉溜时间
   0x0a,0x00,            //148,149-组间延迟 
   0x00,                 //150-    升柱允许
   0x32,0x00,            //151,152-等待时间 
   0x32,0x00,            //153,154-目标行程  
   0x00,                 //155-启动间隔  
   0x00,                 //156-联动伸前梁开始时间
   0x0a,                 //157-联动伸前梁动作时间
   0x0a,                 //158-成组推后溜组间延迟
   0x0a,                 //159-成组伸前梁动作时间
   0x0a,                 //160-成组收前梁动作时间
   0x0a,                 //161-联动收前梁开始时间
   0x0a,                 //162-联动收前梁动作时间
   0x0a,                 //163-Asq顶梁喷雾架数
   0x0a,0x00,			 //164,165-顶梁喷雾时间                                      
   0x01,                 //166-跟机移架范围
   0x01,                 //167-跟机推溜范围
   0x01,                 //168-跟机伸缩梁伸出范围
   0x01,                 //169-跟机伸缩梁收回范围
   0x01,                 //170- 采煤机位置数据报送时间间隔
   0x14,                 //171-网络检测时间间隔
   0x01,                 //172-首架编号
   0x00,                 //173-未用
   0x01,                 //174-自动移架循环次数
   0x00,                 //175-下载间隔
   0x00,0x00,            //176，177-下载延时   
   0x00,0x00,            //178，179-超级密码
   0x13,0x04,            //180,181-密码参数
   0x00,                 //182-关键参数开关
   0x0a,                 //183-隔架侧护动作时间（调架时间） 
   0x0a,                 //184-隔架底调动作时间（调架时间） 
   0x0a,0x00,            //185,186-传感器报送时间   
   0x01,                 //187-成组小号
   0x01,                 //188-成组大号
   0x00,                 //189-各种喷雾允许开关
   0xff,0x00,            //190,191-传感器开关
   0x00,                 //192-跟机护帮板上下行动作控制1--上行护帮板动作2--下行护帮板动作3--上下行均动作
   0x00,                 //193-跟机自动移架上下行动作控制
   0x00,                 //194-跟机推溜上下行动作控制
   0x00,                 //195-跟机喷水上下行动作控制,
					       //bit2：1-前滚筒喷水，0-不喷;bit3：1-后滚筒喷水，0-不喷
   0x00,                 //196-跟机中不动作架大号
   0x00,                 //197-跟机中不动作架小号
   0x00,                 //198-未用
   0x00,                 //199-未用
   0x00,                 //200-降柱时平衡开始动作时间 
   0x04,                 //201-降柱时平衡动作时间
   0x00,				 //202-升柱时平衡开始动作时间
   0x04,                 //203-升柱时平衡动作时间
   0x0a,                 //204-成组喷水范围
   0x0a,                 //205-成组喷水时间
   0x00,                 //206-成组启动间隔
   0x00,                 //207-未用
   0x01,				 //208-中间架小号
   0x01,                 //209-中间架大号 
   0x03,				 //210-放顶煤ASQ收插板动作时间1
   0x00,				 //211-放顶煤ASQ降尾梁开始动作时间1
   0x03,				 //212-放顶煤ASQ降尾梁动作时间1
   0x03,			  	 //213-放煤时间1
   0x03,				 //214-放顶煤ASQ升尾梁动作时间1
   0x03,				 //215-放顶煤ASQ伸插板开始动作时间1
   0x03,			     //216-放顶煤ASQ伸插板动作时间1
   0x03,				 //217-放顶煤上方等待时间1							
   0x01,                 //218-循环次数1
   0x03,				 //219-放顶煤ASQ收插板动作时间2
   0x03,				 //220-放顶煤ASQ降尾梁开始动作时间2
   0x03,				 //221-放顶煤ASQ降尾梁动作时间2
   0x03,				 //222-放煤时间2
   0x03,				 //223-放顶煤ASQ升尾梁动作时间2
   0x03,			 	 //224-放顶煤ASQ伸插板开始动作时间2
   0x03,			     //225-放顶煤ASQ伸插板动作时间2
   0x03,				 //226-放顶煤上方等待时间2							
   0x01,                 //227-循环次数2
   0x03,				 //228-放顶煤ASQ收插板动作时间3
   0x03,				 //229-放顶煤ASQ降尾梁开始动作时间3
   0x03,				 //230-放顶煤ASQ降尾梁动作时间3
   0x03,				 //231-放煤时间3
   0x03,				 //232-放顶煤ASQ升尾梁动作时间3
   0x03,				 //233-放顶煤ASQ伸插板开始动作时间3
   0x03,			     //234-放顶煤ASQ伸插板动作时间3
   0x03,				 //235-放顶煤上方等待时间3							
   0x01,                 //236-循环次数3
   0x03,				 //237-放顶煤架间延迟时间
   0x03,				 //238-动作组
   0x00,				 //239-启动间隔   
   0x03,                 //240-回高位尾梁升时间
   0x03,                 //241-回高位插板伸开始时间
   0x03,                 //242-回高位插板伸动作时间
   0x03,                 //243-回高位组数
   0x00,                 //244-启动间隔
   0x00,				 //245-放煤喷雾允许
   0x03,				 //246-放煤喷雾时间
   0x03,				 //247-放煤喷雾架数
   0x00,                 //248-定时喷雾启动间隔
   0x03,                 //249-定时喷雾组内架数
   0x03,                 //250-定时喷雾动作时间
   0x01,                 //251-定时喷雾动作方向1-从小到大，2-从大到小
   0x00,                 //252-定时喷雾是否允许
   0x0a,0x00,            //253，254-本架伸侧护动作时间 
   0x00,                 //255-未用
   0x00,                 //256联动及自动移架二级护帮伸开始动作时间
   0x00,                 //257联动及自动移架二级护帮伸动作时间        
   0x00,                 //258联动及自动移架三级护帮伸开始动作时间
   0x00,                 //259联动及自动移架三级护帮伸动作时间
   0x00,                 //260联动及自动移架二级护帮收开始动作时间
   0x00,                 //261联动及自动移架二级护帮收动作时间        
   0x00,                 //262联动及自动移架三级护帮收开始动作时间
   0x00,                 //263联动及自动移架三级护帮收动作时间  
   0x00,                 //264-抖动时间
   0x00,                 //265-抖动次数
   0x5e, 0x01,           //266、267-消息窗时间ms
   0x32, 0x00,           //268、269-事件窗时间ms
   0x00,                  //270-成组回高位架间延迟s 
   0xc8,0x00,  		      //271,272 平衡差动开始压力
   0x00,  		          //273  bit0-平衡差动开关:0禁止，1允许 bit1-一级护帮动作喷雾是否允许：0禁止，1允许
   0x00,0x00,             //274,275校正值1
   0x00,0x00,             //276,277校正值2
   0x00,0x00,             //278,279校正值3
   0x00,0x00,             //280,281-长度1
   0x00,0x00,             //282,283-长度2
   0x00,0x00,             //284,285-长度3
   0x00,0x00,             //286，287-底座高度
   0x64,                  //288-倾角报送间隔
   0x00,                  //289-倾角相关控制
   0x00,                  //290 第四倾角传感器安装架数
   0x00,                  //291第四倾角传感器安装标志
   0x00,0x00,             //292,293校正值4
   0x00,                  //294---显示高度阀值
   0x00,                  //295---显示角度阀值
   0x0a,                  //296---检测倾角传感器时间
   0x00,                  //297-bit0：0-x，1-y轴选择
   0x03,                  //298-成组伸三级护帮动作时间
   0x03,                  //299-成组收三级护帮动作时间
   0x03,0x00,             //300,301-降柱高度设置
   0x00,                  //302-倾角设置
   0x00,0x03,             //303,304-伸一级护帮目标行程
   0x32,0x00,             //305,306-收一级护帮目标行程 
      0x2c,0x01,             //307,308-伸一级护帮目标压力
   0x00,                  //309-自动定时反冲洗功能开关
                          //Bit0-反冲功能总开关　0-禁止　1-允许
                          //Bit1-上反冲开关　　　0-禁止　1-允许
                          //Bit2-上反冲开关　　　0-禁止　1-允许
   0x00,                  //310-反冲动作时间
   0x00,                  //311-上下反冲时间间隔
   0x00,                  //312-架间启动时间间隔
   0x00,                  //313-反冲定时1－时
   0x00,                  //314-反冲定时1－分
   0x00,                  //315-反冲定时2－时
   0x00,                  //316-反冲定时2－分
   0x00,                  //317-反冲定时3－时
   0x00,                  //318-反冲定时3－分
   0x00,                  //319-反冲定时4－时
   0x00,                  //320-反冲定时4－分
   0x00,                  //321-一级护帮自动补压相关,//bit0-一级护帮自动补压允许，禁止 
   0x96,0x00,             //322,323-一级护帮自动补压压力下限
   0x2c,0x01,             //324,325-一级护帮自动补压压力上限
   0x01,                  //326-一级护帮自动补压允许次数
   0x05,                  //327-一级护帮自动补压单次时间
   0x05,                  //328-一级护帮自动补压间隔时间
   0x2c,0x01,             //329,330-一级护帮自动补压目标压力
   0x00,                  //331--延时降柱 
   0x00,                  //332-喷雾动作在前滚筒还是后滚筒
   0x00,                  //333-自动移架喷水允许
   0x00,                  //334-自动移架开始喷水时间
   0x00,                  //335-自动移架喷水时间
   0x00,0x00,             //336,337-移架抬底的目标行程 
   0x00,                  //338收一级护帮开始最小时间
   0x00,                  //339收一级护帮开始最大时间 
   0x00,					//340-上行前滚筒距离
   0x00,				  //341-上行前滚筒范围
   0x00,				  //342-上行后滚筒距离
   0x00,				  //343-上行后滚筒范围
   0x00,				  //344-下行前滚筒距离
   0x00,				  //345-下行前滚筒范围
   0x00,				  //346-下行后滚筒距离
   0x00,				  //347-下行后滚筒范围
   0x00,                  //348-跟机喷雾动作时间 
   0x00,                  //349-二级护帮收动作时间
   0x00,                  //350-二级护帮伸动作时间
   0x00,                  //351-联动时二级护帮伸开始时间（第二次动作）
   0x00,                  //352-联动时二级护帮伸动作时间（第二次动作）
   0x00,                  //353-联动时二级护帮收开始时间（第二次动作）
   0x00,                  //354-联动时二级护帮收动作时间（第二次动作）
   0x00,                  //355-二级护帮联动动作开关	  1--伸 0--收
   0x00,                  //356-本架伸顶梁侧护板动作时间
   0x00,                  //357-本架伸掩护梁侧护板动作时间 
   0x00,                  //358-自动移架过程侧护板动作开关
   0x00,                  //359-ASQ中升柱后伸侧护持续时间
   0x00,                  //360-ASQ中移架后伸侧护持续时间
   0x00,                  //361-ASQ中收抬底座动作时间
   0x05,                  //362-单动升柱后侧护解锁持续时间
   0x05,   				  //363-ASQ中升柱侧护解锁持续时间
   0x00,                  //364-成组反冲洗启动间隔
   0x0a,                  //365-成组反冲洗动作范围
   0x0d,                  //366-时钟修改年
   0x01,                  //367-时钟修改月
   0x01,                  //368-时钟修改日
   0x01,                  //369-时钟修改时
   0x01,                  //370-时钟修改分
   0x01,                  //371-时钟修改星期
   0x00,0x00,             //372、373-激光测距仪安装高度
   0x00,0x00,             //374、375-红外信号保持时间 
   0x00,                  //376-端头小号
   0x00,                  //377-端头架大号
   0x64,                  //378-顶梁和掩护梁夹角
   0xff,                  //379-顶梁上扬限制角度  
   0x00,                  //380-顶梁下栽限制角度 
   0x00,                  //381-自动跟机类型
   0x01,
   0x00,
   0x0a,
   0x00,
   0x0a,
   0x00,
   0x0a,
   0x00,
   0x0a,                                   
};
