/****************************************Copyright (c)****************************************************
**                  
**                                      
**                                 
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               PressureSnr.h
** Latest modified Date:    2017-04-03
** Latest Version:          1.0.0
** Descriptions:            压力传感器设置菜单头文件
**
**--------------------------------------------------------------------------------------------------------
** Created by:              
** Created date:            2017-04-03
** Version:                 1.0.0
** Descriptions:            The original version
**--------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
** Version:                 
** Descriptions:            
**
*********************************************************************************************************/
#ifndef __PRESSURE_SNR_H
#define __PRESSURE_SNR_H

#ifdef __cplusplus
extern "C" {
#endif                                                                  /*  __cplusplus                 */
/*********************************************************************************************************
** Function name:           miPressureSnrInit
** Descriptions:            压力传感器设置菜单项初始化
** input parameters:        none
** output parameters:       none
** Returned value:          none
*********************************************************************************************************/
extern void miPressureSnrInit (void);
/*********************************************************************************************************
** Function name:           miPressureSnrDel
** Descriptions:            压力传感器设置菜单项卸载
** input parameters:        none
** output parameters:       none
** Returned value:          none
*********************************************************************************************************/
extern void miPressureSnrDel (void);

#ifdef __cplusplus
}
#endif                                                                  /*  __cplusplus                 */

#endif                                                                  /*  __PRESSURE_SNR_H            */

/*********************************************************************************************************
  END FILE
*********************************************************************************************************/
