/***********************************************Copyright (c)********************************************* 
**                                 
**                                      
**                                       
** 
**--------------File Info--------------------------------------------------------------------------------- 
** File name:               CmdStr.h 
** Last modified Date:      2013-12-31 
** Last Version:            1.0 
** Descriptions:            字符串解析函数头文件 
** 
**-------------------------------------------------------------------------------------------------------- 
** Created by:               
** Created date:            2013-12-31 
** Version:                 1.0 
** Descriptions:             
** 
**-------------------------------------------------------------------------------------------------------- 
** Modified by:              
** Modified Date:            
** Version:                  
** Descriptions:             
** 
*********************************************************************************************************/ 
#ifndef __CMDSTR_H 
#define __CMDSTR_H 
 
#define __ARG_CMD_FORMAT    0 
/********************************************************************************************************* 
** Function name:           ImpCmd 
** Descriptions:            用户字符命令转换为系统可设置的数字参数 
** input parameters:        ID     : 外设编号:Tab_UART,Tab_I2C,参数表参见Deviceconfig.h 
**                          arg    : 用户输入的字符串指针 
**                          para_data  : 转换后的数字参数地址 
** Returned value:          >0  :表示解析成功的字符串个数 
*********************************************************************************************************/ 
int ImpCmd(unsigned int ID, char *arg, unsigned int *para_data ); 
 
/********************************************************************************************************* 
** Function name:           ExpCmd 
** Descriptions:            系统设置的数字参数转换为字符串输出 
** input parameters:        ID     : 外设编号:Tab_UART,Tab_I2C,参数表参见Deviceconfig.h 
**                          arg    : 输出的用户的用户参数字符串指针 
**                          para_data  : 系统的数字参数地址 
**                          para_num   : 某外设的参数个数 
** Returned value:          OPERATE_SUCCESS--操作成功 
********************************************************************************************************/ 
int ExpCmd(unsigned int ID, char *arg, unsigned int *para_data ); 
 
 
 
#endif                                                                  /* __CMDSTR_H                   */ 
/********************************************************************************************************* 
   END FILE 
*********************************************************************************************************/ 

