/****************************************Copyright (c)****************************************************
**                      Beijing Huatai Industrial Equipment Co.,Ltd.
**                                      
**                                 http://www.huatai.com.cn                              
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               AsqCfg.h
** Latest modified Date:    2021-12-26
** Latest Version:          1.0
** Descriptions:            自动移架参数配置菜单头文件
**
**--------------------------------------------------------------------------------------------------------
** Created by:              超人力霸王
** Created date:            2021-12-26
** Version:                 1.0
** Descriptions:            The original version
**
**--------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
** Version:                 
** Descriptions:            
**
*********************************************************************************************************/
#ifndef __ASQ_CFG_H
#define __ASQ_CFG_H

#ifdef __cplusplus
extern "C" {
#endif                                                                  /*  __cplusplus                 */
/*********************************************************************************************************
** Function name:           miAsqCfgInit
** Descriptions:            自动移架参数设置菜单项初始化
** input parameters:        none
** output parameters:       none
** Returned value:          none
*********************************************************************************************************/
extern void miAsqCfgInit (void);

/*********************************************************************************************************
** Function name:           miAsqCfgDel
** Descriptions:            自动移架参数设置菜单项卸载
** input parameters:        none
** output parameters:       none
** Returned value:          none
*********************************************************************************************************/
extern void miAsqCfgDel (void);

#ifdef __cplusplus
}
#endif                                                                  /*  __cplusplus                 */

#endif                                                                  /*  __ASQ_CFG_H                 */

/*********************************************************************************************************
  END FILE
*********************************************************************************************************/
