/****************************************Copyright (c)****************************************************
**                              
**
**
**--------------File Info---------------------------------------------------------------------------------
** File name:           eint.h
** Last modified Date:  2013-03-15
** Last Version:        1.0
** Descriptions:        eint驱动外部头文件
**--------------------------------------------------------------------------------------------------------
** Created by:          
** Created date:        2013-03-15
** Version:             V1.0
** Descriptions:        The original version
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
*********************************************************************************************************/

#ifndef __EINT_H_
#define __EINT_H_

#ifdef __cplusplus
extern "C" {
#endif                                                                  /*  __cplusplus                */

/*********************************************************************************************************
  EINT 相关索引
*********************************************************************************************************/
#define  EINT0              0                                           /*  EINT0 ID 号                 */
#define  EINT1              1                                           /*  EINT1 ID 号                 */
#define  EINT2              2                                           /*  EINT2 ID 号                 */
#define  EINT3              3                                           /*  EINT3 ID 号                 */

/*********************************************************************************************************
  EINT中断通道号
*********************************************************************************************************/

#define  EINT0_IRQ_CHN      14                                          /*  EINT0中断通道号             */
#define  EINT1_IRQ_CHN      15                                          /*  EINT1中断通道号             */
#define  EINT2_IRQ_CHN      16                                          /*  EINT2中断通道号             */
#define  EINT3_IRQ_CHN      17                                          /*  EINT3中断通道号             */

/*********************************************************************************************************
  设置外部中断触发方式命令
*********************************************************************************************************/
#define  SET_INTMODE        0                                           /*  中断触发模式模式设置命令    */
#define  SET_WAKEMODE       1                                           /*  中断掉电唤醒模式设置命令    */

/*********************************************************************************************************  
** Function name:           eintInit  
** Descriptions:            外部中断初始化           
** Input parameters:        uiId            eint器件号 EINT0,EINT1,EINT2,EINT3  
**                          pcArg           配置参数字符串指针  
**                          Mode:           
**                          0               表示使用电平激活，1表示使用边沿激活  
**                          1               表示高电平或上升没有效(取决于Mode)  
**                          Wake:            
**                          0               表示不使中断唤醒  
**                          1               表示使能中断唤醒                                                         
**                          pRsv:           保留参数  
** Output parameters:       NONE  
** Returned value:          OPERATE_SUCCESS         操作成功   
**                          -OPERATE_FAIL           操作失败   
** Example:                 char cEint0Arg[] = "Mode=0 Wake=0";  
**                          eintInit(EINT0, cEint0Arg, NULL);   
**********************************************************************************************************/  
extern INT32S eintInit (uint32 uiId, char *pcArg, void *pRsv);

/*********************************************************************************************************
** Function name:           eintSetMode
** Descriptions:            设置外部中断功能参数
** input parameters:        uid             eint器件号
**                          uimd            设置命令码
**                          pcArg           配置字符串参数指针
** output parameters:       None               
** Returned value:          OPERATE_SUCCESS 操作成功
**                          -OPERATE_FAIL   操作失败
*********************************************************************************************************/
extern INT32S eintSetMode(INT32U ulId, INT32U ulCmd, char *pucArg);

/*********************************************************************************************************
** Function name:           eintWaitClr
** Descriptions:            等待中断条件撤销
** input parameters:        ulId            eint器件号
** output parameters:       None               
** Returned value:          OPERATE_SUCCESS 操作成功
**                          -OPERATE_FAIL   操作失败
*********************************************************************************************************/
extern INT32S eintWaitClr(INT32U ulId);

/*********************************************************************************************************  
** Function name:           eintIsr  
** Descriptions:            外部中断服务子程序
** input parameters:        uiId            eint器件号  
** Output parameters:       NONE  
** Returned value:          无  
*********************************************************************************************************/   
extern void eintIsr(INT32U ulId);

#ifdef __cplusplus 
}
#endif                                                                  /*  __cplusplus                */ 

#endif                                                                  /*  _EINT_H_                   */ 

/*********************************************************************************************************
  END FILE
*********************************************************************************************************/
