/****************************************Copyright (c)****************************************************
**                      Beijing Huatai Industrial Equipment Co.,Ltd.
**                                      
**                                 http://www.huatai.com.cn 
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               tpPorts.h
** Latest modified Date:    2014-08-25
** Latest Version:          1.0.0
** Descriptions:            目标板端口地址相关定义
**
**--------------------------------------------------------------------------------------------------------
** Created by:              超人力霸王
** Created date:            2014-08-25
** Version:                 1.0.0
** Descriptions:            The original version
**
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************/
#ifndef __TP_PORTS_H
#define __TP_PORTS_H

#ifdef __cplusplus
extern "C" {
#endif   
/*********************************************************************************************************
  设备通用功能端口基地址
*********************************************************************************************************/
#define  TP_STOP_PORT_ADDR      0x00                                    /*  急停端口地址                */

typedef enum port_addr {
  __TP_KEY              = 0x00,                                         /*  按键                        */    
  __TP_PRINTF           = 0x01,                                         /*  GUI_Printf                  */
  __TP_CLR_SCR          = 0x02,                                         /*  GUI_ClearSCR                */
  __TP_CLR_RECT         = 0x03,                                         /*  GUI_ClearRectangle          */


  __TP_LED_ON           = 0x06,                                         /*  led on                      */
  __TP_LED_OFF          = 0x07,                                         /*  led off                     */
  __TP_LED_BLINK        = 0x08,                                         /*  led blink                   */
  __TP_PROG             = 0x09,                                         /*  程序删除/发布               */
} PORT_ADDR;




#include ".\tpKey\tpKey.h" 
#ifdef __cplusplus
}
#endif   
#endif                                                                  /*  __TP_PORTS_H                */

/*********************************************************************************************************
  END FILE
*********************************************************************************************************/
