/****************************************Copyright (c)****************************************************
**
**
**--------------File Info---------------------------------------------------------------------------------
** File name:           Timer.h
** Last modified Date:  2013-08-22
** Last Version:        1.0
** Descriptions:        Timer参数配置信息
**--------------------------------------------------------------------------------------------------------
** Created by:          
** Created date:        2013-08-22
** Version:             1.00
** Descriptions:        The original version
**--------------------------------------------------------------------------------------------------------
** Modified by:         
** Modified date:       
** Version:
** Descriptions:
*********************************************************************************************************/
#ifndef _Timer_H_
#define _Timer_H_

#ifdef __cplusplus
extern "C" {
#endif                                                                  /*  __cplusplus                 */

/*********************************************************************************************************
  Timer标示
*********************************************************************************************************/
#define TIMER1          1

/*********************************************************************************************************
  Timer中断通道号
*********************************************************************************************************/
#define TIMER0_IRQ_CHN  4
#define TIMER1_IRQ_CHN  5


/*********************************************************************************************************
  模式设定命令
*********************************************************************************************************/
#define SET_TIMERMODE   0                                               /*  定时模式设置                */
#define SET_MATMODE     1                                               /*  匹配模式设置                */
#define SET_CAPMODE     2                                               /*  捕获模式设置                */

/*********************************************************************************************************
  捕获寄存器定义
*********************************************************************************************************/
#define CR0             0                                               /*  捕获寄存器0                 */
#define CR1             1                                               /*  捕获寄存器1                 */

/*********************************************************************************************************
** Function name:           timerInit
** Descriptions:            Timer初始化
** input parameters:        uiId            timer器件号
**                          pcArg           配置参数字符串指针                                         
**                          pRsv            保留参数
** output parameters:       None
** Returned value:          OPERATE_SUCCESS 操作成功 
**                          -OPERATE_FAIL   操作失败
*********************************************************************************************************/
extern INT32S timerInit(INT32U ulId, char *pucArg, void *pvRsv);

/*********************************************************************************************************
** Function name:           timerSetMode
** Descriptions:            Timer模式设置
** input parameters:        uiId            timer器件号          
**                          uiCmd           命令参数
**                          pucArg          配置参数字符串指针
** output parameters:       None
** Returned value:          OPERATE_SUCCESS 操作成功 
**                          -OPERATE_FAIL   操作失败
*********************************************************************************************************/
extern INT32S timerSetMode(INT32U ulId, INT32U ulCmd, char *pucArg);

/*********************************************************************************************************
** Function name:           timerStart
** Descriptions:            Timer启动
** input parameters:        uiId            timer器件号
**                                                          
**                      
** output parameters:       None
** Returned value:          OPERATE_SUCCESS 操作成功 
**                          -OPERATE_FAIL   操作失败
*********************************************************************************************************/
extern INT32S timerStart(INT32U ulId);

/*********************************************************************************************************
** Function name:           timerStop
** Descriptions:            Timer停止
** input parameters:        uiId            timer器件号        
**                                                          
**                      
** output parameters:       None
** Returned value:          OPERATE_SUCCESS 操作成功 
**                          -OPERATE_FAIL   操作失败
*********************************************************************************************************/
extern INT32S timerStop(INT32U ulId);

/*********************************************************************************************************
** Function name:           timerReset
** Descriptions:            Timer复位
** input parameters:        uiId            timer器件号
**                                                          
**                      
** output parameters:       None
** Returned value:          OPERATE_SUCCESS 操作成功 
**                          -OPERATE_FAIL   操作失败
*********************************************************************************************************/
extern INT32S timerReset(INT32U ulId);

/*********************************************************************************************************
** Function name:           timerGetTc
** Descriptions:            获得当前计数值
** input parameters:        uiId            timer器件号
**                                                          
**                      
** output parameters:       None
** Returned value:          OPERATE_SUCCESS 操作成功 
**                          -OPERATE_FAIL   操作失败
*********************************************************************************************************/
extern INT32S timerGetTc(INT32U ulId);

/*********************************************************************************************************
** Function name:           timerGetCR
** Descriptions:            获得当前捕获值
** input parameters:        uiId            timer器件号
**                          uiCRx           捕获通道                             
**                      
** output parameters:       None
** Returned value:          OPERATE_SUCCESS 操作成功 
**                          -OPERATE_FAIL   操作失败
*********************************************************************************************************/
extern INT32S  timerGetCR(INT32U ulId, INT32U ulCRx);

/*********************************************************************************************************
** Function name:           timerIsr
** Descriptions:            timer中断服务程序
** Input parameters:        uiId            timer器件号
** Output parameters:       NONE
** Returned value:          NONE
*********************************************************************************************************/
extern void timerIsr(INT32U ulId);

#ifdef __cplusplus
}
#endif                                                                  /*  __cplusplus                 */
#endif                                                                  /*  _Timer_H_                   */
/*********************************************************************************************************
  END FILE
*********************************************************************************************************/
