/****************************************Copyright (c)****************************************************
**                          Beijing Hengfengli Technology CO.,LTD.
**                                      
**                                 http://www.hengfengli.com/
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               tpUsr.h
** Latest modified Date:    2018-11-26
** Latest Version:          1.0
** Descriptions:            Anyport协议栈用户接口头文件
**
**--------------------------------------------------------------------------------------------------------
** Created by:              超人力霸王
** Created date:            2018-11-26
** Version:                 1.0
** Descriptions:            The original version
**
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************/
#ifndef __TP_USR_H
#define __TP_USR_H

#ifdef __cplusplus
extern "C" {
#endif                                                                  /*  __cplusplus                 */


  
/*********************************************************************************************************
** Function name:           tpUsrInit
** Descriptions:            用户初始化
** input parameters:        none
** output parameters:       none
** Returned value:          none
*********************************************************************************************************/
extern void tpUsrInit(void);




#ifdef __cplusplus
}
#endif                                                                  /*  __cplusplus                 */

#endif                                                                  /*  __TP_USR_H                  */

/*********************************************************************************************************
  END FILE
*********************************************************************************************************/

