/****************************************Copyright (c) ***************************************************
**                         Guangzhou ZHIYUAN electronics Co.,LTD.                               
**                                     
**                               http://www.embedtools.com
**
**--File Info---------------------------------------------------------------------------------------------
**  File name:              ISR.c
**  Last modified Date:
**  Last Version:           V1.0
**  Descriptions: 
**
**--------------------------------------------------------------------------------------------------------
** Created by:
** Created date: 
** Version: 
** Descriptions:
**
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************/

#include ".\main.h"

/*********************************************************************************************************
** Function name:       DefIRQ_Exception
** Descriptions:        默认中断服务程序
** input parameters:    None
** output parameters:   None
** Returned value:      None
*********************************************************************************************************/
void  DefIRQ_Exception (void)
{
    while(1) {                                                          /*  这一句替换为自己的代码      */
        ;
    } 
    VICVectAddr = 0;                                                    
}

/*********************************************************************************************************
** Function name:       FIQ_Exception
** Descriptions:        FIQ中断服务程序
** input parameters:    None
** output parameters:   None
** Returned value:      None
*********************************************************************************************************/
void FIQ_Exception (void)
{
                                                                        /*  1.添加用户FIQ中断服务代码   */
                                                                        /*  2.清除中断标志位            */
    while(1) {                                                          /*  这一句替换为自己的代码      */
        ;
    }    
}


/*********************************************************************************************************
** Function name:           UART0_ISR
** Descriptions:            UART0中断响应函数
** input parameters:        none
** output parameters:       none
** Returned value:          none                          
** Created by:              
** Created date:            
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
*********************************************************************************************************/
void UART0_ISR (void)
{
   /*  
    *  添加用户代码        
    *  ............
    */ 
    uartIsr(UART0);
    VICVectAddr =0x00;                                                  /* 通知CPU中断结束              */ 
}

/*********************************************************************************************************
** Function name:           UART1_ISR
** Descriptions:            UART1中断响应函数
** input parameters:        none
** output parameters:       none
** Returned value:          none                          
** Created by:              
** Created date:            
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
*********************************************************************************************************/
void UART1_ISR (void)
{
   /*  
    *  添加用户代码        
    *  ............
    */ 
    uartIsr(UART1);
    VICVectAddr =0x00;                                                  /* 通知CPU中断结束              */ 
}

/*********************************************************************************************************
** Function name:           I2C0_ISR
** Descriptions:            I2C0中断服务程序
** input parameters:        none
** output parameters:       none
** Returned value:          none                          
** Created by:              
** Created date:            
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
*********************************************************************************************************/
void I2C0_ISR (void)
{
   /*  
    *  添加用户代码        
    *  ............
    */ 
    i2cIsr(I2C0);
    VICVectAddr =0x00;                                                  /* 通知CPU中断结束              */ 
}
/*********************************************************************************************************
** Function name:           TIMER1_ISR
** Descriptions:            TIMER1中断响应函数
** input parameters:        none
** output parameters:       none
** Returned value:          none                          
** Created by:              
** Created date:            
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
*********************************************************************************************************/
void TIMER1_ISR (void)
{
   /*  
    *  添加用户代码        
    *  ............
    */
    
    gpioCpl(P0_17); 
    timerIsr(TIMER1);
    VICVectAddr =0x00;                                                  /* 通知CPU中断结束              */ 
}
/*********************************************************************************************************
** Function name:           WDT0_ISR
** Descriptions:            WDT中断响应函数
** input parameters:        none
** output parameters:       none
** Returned value:          none                          
** Created by:              
** Created date:            
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
*********************************************************************************************************/
void WDT0_ISR (void)
{
   /*  
    *  添加用户代码        
    *  ............
    */ 
    wdtIsr(WDT0);
    VICVectAddr =0x00;                                                  /* 通知CPU中断结束              */
   
}

/*********************************************************************************************************
** Function name:           EINT0_ISR
** Descriptions:            外部中断0用户响应函数
** input parameters:        none
** output parameters:       none
** Returned value:          none                          
** Created by:              
** Created date:            
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
*********************************************************************************************************/
void EINT0_ISR (void)
{
   /*  
    *  添加用户代码        
    *  ............
    */ 
    eintIsr(EINT0);                       
    VICVectAddr =0x00;                                                  /* 通知CPU中断结束              */                
}

/*********************************************************************************************************
** Function name:           EINT1_ISR
** Descriptions:            外部中断1用户响应函数
** input parameters:        none
** output parameters:       none
** Returned value:          none                          
** Created by:              
** Created date:            
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
*********************************************************************************************************/
void EINT1_ISR (void)
{
   /*  
    *  添加用户代码        
    *  ............
    */ 
    eintIsr(EINT1);                    
    VICVectAddr =0x00;                                                  /* 通知CPU中断结束              */              
}

/*********************************************************************************************************
** Function name:           EINT2_ISR
** Descriptions:            外部中断2用户响应函数
** input parameters:        none
** output parameters:       none
** Returned value:          none                          
** Created by:              
** Created date:            
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
*********************************************************************************************************/
void EINT2_ISR (void)
{
   /*  
    *  添加用户代码        
    *  ............
    */
//    usLsr = ioInportWord(0x82000010);
//    if (((usLsr & 0x0100) != 0) && ((usLsr & 0x0040) != 0)) {//只处理急停命令,急停，闭锁均按下
//       safeDeal(usLsr);
//    }
//    else if((usLsr & 0x01) || ((usLsr & 0x02))) {                                                  /*  急停                        */
//       safeDeal(usLsr);
//    } 
        
    uartIsr(UART2);
    uartIsr(UART3);
    uartIsr(UART4);
    uartIsr(UART5);
    eintIsr(EINT2);                  
    VICVectAddr =0x00;                                                  /* 通知CPU中断结束              */               
}

/*********************************************************************************************************
** Function name:           EINT3_ISR
** Descriptions:            外部中断3用户响应函数
** input parameters:        none
** output parameters:       none
** Returned value:          none                          
** Created by:              
** Created date:            
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
*********************************************************************************************************/
void EINT3_ISR (void)
{
   /*  
    *  添加用户代码        
    *  ............
    */ 
    eintIsr(EINT3);                   
    VICVectAddr =0x00;                                                  /* 通知CPU中断结束              */              
}

/*********************************************************************************************************
** Function name:           ADC0_ISR
** Descriptions:            ADC中断响应函数
** input parameters:        none
** output parameters:       none
** Returned value:          none                          
** Created by:              
** Created date:            
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
*********************************************************************************************************/
void ADC0_ISR(void)
{ 
   /*  
    *  添加用户代码        
    *  ............
    */ 
    adcIsr(ADC0);
    VICVectAddr =0x00;                                                  /* 通知CPU中断结束              */ 
} 

/*********************************************************************************************************
** Function name:           CAN_ISR
** Descriptions:            CAN中断响应函数
** input parameters:        none
** output parameters:       none
** Returned value:          none                          
** Created by:              
** Created date:            
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
*********************************************************************************************************/
void CAN_ISR(void)
{       
   /*  
    *  添加用户代码        
    *  ............
    */ 
    canIsr();   
    VICVectAddr = 0x00;
}

/*********************************************************************************************************
** Function name:           RTC0_ISR
** Descriptions:            RTC中断服务程序
** input parameters:        none
** output parameters:       none
** Returned value:          none                          
** Created by:              
** Created date:            
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
*********************************************************************************************************/
void RTC0_ISR (void)
{
   /*  
    *  添加用户代码        
    *  ............
    */ 
    rtcIsr(RTC0);
    VICVectAddr =0x00;                                                  /* 通知CPU中断结束              */ 
}

/*********************************************************************************************************
** Function name:           SPI0_ISR
** Descriptions:            SPI0中断服务程序
** input parameters:        none
** output parameters:       none
** Returned value:          none                          
** Created by:              
** Created date:            
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
*********************************************************************************************************/
void SPI0_ISR (void)
{ 
   /*  
    *  添加用户代码        
    *  ............
    */ 
    spiIsr(SPI0);                                                    /*  清除中断标志,             */
    VICVectAddr =0x00;                                                  /* 通知CPU中断结束              */                                                                                              
}
/*********************************************************************************************************
  END FILE
*********************************************************************************************************/
