/****************************************Copyright (c)****************************************************
**                      Beijing Huatai Industrial Equipment Co.,Ltd.
**                                      
**                                 http://www.huatai.com.cn  
**
**--------------File Info---------------------------------------------------------------------------------
**  File name :         key.c
**  Last modified Date :
**  Last Version :      V1.00
**  Descriptions :      按键处理函数
**
**--------------------------------------------------------------------------------------------------------
** Created by:          
** Created date:        2014-08-25
** Version:             V1.00
** Descriptions :      
**--------------------------------------------------------------------------------------------------------
** Modified by :        超人力霸王
** Modified date :      2020-02-20
** Version :            V2.00
** Descriptions :       规范化代码格式
*********************************************************************************************************/

#include "main.h"


static const INT32U __SuiKeyTblBase[] = {                        /*  基础键盘定义                */
                            JP_NOP,                                     /*  降柱                        */
                            JP_NOP,                                     /*  移架                        */
                            JP_NOP,                                     /*  升柱                        */
                            JP_NOP,                                     /*  推溜                        */
                            JP_NOP,                                     /*  抬底                        */
                            JP_NOP,                                     /*  伸平衡                      */
                            JP_NOP,                                     /*  收平衡                      */
                            JP_NOP,                                     /*  伸伸缩梁                    */
                            JP_NOP,                                     /*  收伸缩梁                    */
                            JP_NOP,                                     /*  伸一级护帮                  */
                            JP_NOP,                                     /*  收一级护帮                  */
                            JP_NOP,                                     /*  伸二级护帮                  */
                            JP_NOP,                                     /*  收二级护帮                  */
                            JP_NOP,                                     /*  三级护帮板伸                */
                            JP_NOP,                                     /*  三级护帮板收                */                            
                            JP_NOP,                                     /*  喷雾                        */
                            JP_NOP,                                     /*  远程                        */
                            JP_NOP,                                     /*  左邻架                      */
                            JP_NOP,                                     /*  右邻架                      */
                            JP_B,                                       /*  启动                        */
                            JP_E,                                       /*  停止                        */
                            JP_NOP,                                     /*  左成组                      */
                            JP_NOP,                                     /*  右成组                      */
                            JP_NOP,                                     /*  收侧护                      */
                            JP_NOP,                                     /*  伸侧护                      */
                            JP_NOP,                                     /*  收底调                      */
                            JP_P,                                       /*  左翻菜单                    */
                            JP_NOP,                                     /*  伸底调                      */
                            JP_N,                                       /*  右翻菜单                    */
                            JP_U,                                       /*  上翻菜单                    */
                            JP_D,                                       /*  下翻菜单                    */
                            JP_NOP,                                     /*  加1计数                     */
                            JP_NOP,                                     /*  减1计数                     */
                            JP_B,                                       /*  确认                        */
                            JP_K,                                       /*  左辅助按键                  */
                            JP_M,                                       /*  右辅助按键                  */
                            JP_NOP,                                     /*  降前柱                      */
                            JP_NOP,                                     /*  升前柱                      */
                            JP_NOP,                                     /*  降中柱                      */
                            JP_NOP,                                     /*  升中柱                      */
                            JP_NOP,                                     /*  降后柱                      */
                            JP_NOP,                                     /*  升后柱                      */
                            JP_NOP,                                     /*  伸尾梁                      */
                            JP_NOP,                                     /*  收尾梁                      */
                            JP_NOP,                                     /*  伸插板                      */
                            JP_NOP,                                     /*  收插板                      */
                            JP_NOP,                                     /*  伸后溜                      */
                            JP_NOP,                                     /*  拉后溜                      */
                            JP_NOP,                                     /*  伸前梁                      */
                            JP_NOP,                                     /*  收前梁                      */
                            JP_NOP,                                     /*  反冲洗1                     */
                            JP_NOP,                                     /*  反冲洗2                     */
                            JP_NOP,                                     /*  伸摆梁                      */
                            JP_NOP,                                     /*  收摆梁                      */
                            JP_NOP,                                     /*  成组推溜                    */
                            JP_NOP,                                     /*  成组拉溜                    */
                            JP_NOP,                                     /*  成组一级护帮板伸            */
                            JP_NOP,                                     /*  成组一级护帮板收            */
                            JP_NOP,                                     /*  成组二级护帮板伸            */
                            JP_NOP,                                     /*  成组二级护帮板收            */
                            JP_NOP,                                     /*  成组前梁伸                  */
                            JP_NOP,                                     /*  成组前梁收                  */
                            JP_NOP,                                     /*  成组拉后溜                  */
                            JP_NOP,                                     /*  成组伸伸缩梁                */
                            JP_NOP,                                     /*  成组收伸缩梁                */
                            JP_NOP,                                     /*  成组三级护帮板伸            */
                            JP_NOP,                                     /*  成组三级护帮板收            */
                            JP_NOP,                                     /*  本架拉后溜                  */
                            JP_NOP,                                     /*  本架推溜                    */
                            JP_NOP,                                     /*  本架伸侧护                  */
                            JP_NOP,                                     /*  放煤喷雾                    */
                            JP_NOP,                                     /*  顶梁喷雾                    */
                            JP_NOP,                                     /*  机道喷雾                    */
                            JP_NOP,                                     /*  反冲洗3                     */
                            JP_NOP,                                     /*  反冲洗4                     */
                            JP_NOP,                                     /*  升尾柱                      */
                            JP_NOP,                                     /*  收尾柱                      */
                            JP_NOP,                                     /*  成组放煤喷雾                */
                            JP_NOP,                                     /*  成组顶梁喷雾                */
                            JP_NOP,                                     /*  成组机道喷雾                */
                            JP_NOP,                                     /*  成组喷雾                    */
                            JP_NOP,                                     /*  工况                        */
                            JP_NOP,                                     /*  护帮板联动控制键            */
                            JP_NOP,                                     /*  成组反冲洗按键              */
                            JP_NOP,                                     /*  时钟显示快捷按键            */
                            JP_NOP,                                     /*  立柱补压参数快捷键升柱键关联*/
                            JP_NOP,                                     /*  立柱补压功能快捷键          */
                            JP_NOP,                                     /*  立柱补压功能快捷键-组合键2  */
                            JP_L,                                       /*  本架自控                    */
                            JP_NOP,                                     /*  头右升                      */
                            JP_NOP,                                     /*  头左升                      */
                            JP_NOP,                                     /*  头右降                      */
                            JP_NOP,                                     /*  头左降                      */
                            JP_NOP,                                     /*  尾左升                      */
                            JP_NOP,                                     /*  尾右升                      */
                            JP_NOP,                                     /*  尾右降                      */
                            JP_NOP,                                     /*  左推伸                      */
                            JP_NOP,                                     /*  左推收                      */
                            JP_NOP,                                     /*  头左移                      */
                            JP_NOP,                                     /*  头右移                      */
                            JP_NOP,                                     /*  尾左移                      */
                            JP_NOP,                                     /*  尾右移                      */
                            JP_NOP,                                     /*  右推伸                      */
                            JP_NOP,                                     /*  右推收                      */
                            JP_NOP,                                     /*  尾左降                      */
                            JP_A,                                       /*  推移伸                      */
                            JP_NOP,                                       /*  推移收                      */
                            JP_NOP,                                     /*  左伸缩伸                    */
                            JP_NOP,                                     /*  左伸缩收                    */
                            JP_NOP,                                     /*  右伸缩伸                    */
                            JP_NOP,                                     /*  右伸缩收                    */
                            JP_NOP,                                     /*  挑带伸                      */
                            JP_NOP,                                     /*  挑带收                      */
                            JP_NOP,                                     /*  侧一伸                      */
                            JP_NOP,                                     /*  侧一收                      */
                            JP_NOP,                                     /*  侧二伸                      */
                            JP_NOP,                                     /*  侧二收                      */
                            JP_NOP,                                     /*  侧三伸                      */
                            JP_NOP,                                     /*  侧三收                      */
                            JP_NOP,                                     /*  侧四伸                      */
                            JP_NOP,                                     /*  侧四收                      */
                            JP_NOP,                                       /*  抬架伸                      */
                            JP_NOP,                                       /*  抬架收                      */
                            JP_NOP,                                       /*  底调左                      */
                            JP_NOP,                                       /*  底调右                      */
                            JP_1,                                       /*  底调上                      */
                            JP_2,                                       /*  底调下                      */
                            JP_3,                                       /*  顶梁伸                      */
                            JP_4,                                       /*  顶梁收                      */                               
                            
};
#if 0
static const INT32U __SuiKeyTblMiddle[KEY_MAX] = {                      /*  中间架键盘定义              */  	
                            JP_NOP,                                     /*  降柱                        */
                            JP_P,                                       /*  移架                        */
                            JP_NOP,                                     /*  升柱                        */
                            JP_L,                                       /*  推溜                        */
                            JP_3,                                       /*  抬底                        */
                            JP_C,                                       /*  伸平衡                      */
                            JP_D,                                       /*  收平衡                      */
                            JP_E,                                       /*  伸伸缩梁                    */
                            JP_F,                                       /*  收伸缩梁                    */
                            JP_9,                                       /*  伸一级护帮                  */
                            JP_6,                                       /*  收一级护帮                  */
                            JP_NOP,                                     /*  伸二级护帮                  */
                            JP_NOP,                                     /*  收二级护帮                  */
                            JP_NOP,                                     /*  三级护帮板伸                */
                            JP_NOP,                                     /*  三级护帮板收                */                            
                            JP_NOP,                                     /*  喷雾                        */
                            JP_NOP,                                     /*  远程                        */
                            JP_1,                                       /*  左邻架                      */
                            JP_2,                                       /*  右邻架                      */
                            JP_N,                                       /*  启动                        */
                            JP_S,                                       /*  停止                        */
                            JP_4,                                       /*  左成组                      */
                            JP_5,                                       /*  右成组                      */
                            JP_8,                                       /*  收侧护                      */
                            JP_7,                                       /*  伸侧护                      */
                            JP_NOP,                                     /*  收底调                      */
                            JP_L,                                       /*  左翻菜单                    */
                            JP_NOP,                                     /*  伸底调                      */
                            JP_R,                                       /*  右翻菜单                    */
                            JP_H,                                       /*  上翻菜单                    */
                            JP_W,                                       /*  下翻菜单                    */
                            JP_K,                                       /*  加1计数                     */
                            JP_M,                                       /*  减1计数                     */
                            JP_N,                                       /*  确认                        */
                            JP_K,                                       /*  左辅助按键                  */
                            JP_M,                                       /*  右辅助按键                  */
                            JP_B,                                       /*  降前柱                      */
                            JP_A,                                       /*  升前柱                      */
                            JP_NOP,                                     /*  降中柱                      */
                            JP_NOP,                                     /*  升中柱                      */
                            JP_NOP,                                     /*  降后柱                      */
                            JP_NOP,                                     /*  升后柱                      */
                            JP_NOP,                                     /*  伸尾梁                      */
                            JP_NOP,                                     /*  收尾梁                      */
                            JP_NOP,                                     /*  伸插板                      */
                            JP_NOP,                                     /*  收插板                      */
                            JP_NOP,                                     /*  伸后溜                      */
                            JP_NOP,                                     /*  拉后溜                      */
                            JP_0,                                       /*  伸前梁                      */
                            JP_R,                                       /*  收前梁                      */
                            JP_NOP,                                     /*  反冲洗1                     */
                            JP_NOP,                                     /*  反冲洗2                     */
                            JP_NOP,                                     /*  伸摆梁                      */
                            JP_NOP,                                     /*  收摆梁                      */
                            JP_L,                                       /*  成组推溜                    */
                            JP_P,                                       /*  成组拉溜                    */
                            JP_NOP,                                       /*  成组一级护帮板伸            */
                            JP_NOP,                                       /*  成组一级护帮板收            */
                            JP_NOP,                                     /*  成组二级护帮板伸            */
                            JP_NOP,                                     /*  成组二级护帮板收            */
                            JP_9,                                     /*  成组前梁伸                  */
                            JP_6,                                     /*  成组前梁收                  */
                            JP_NOP,                                     /*  成组拉后溜                  */
                            JP_3,                                       /*  成组伸伸缩梁                */
                            JP_8,                                       /*  成组收伸缩梁                */
                            JP_NOP,                                     /*  成组三级护帮板伸            */
                            JP_NOP,                                     /*  成组三级护帮板收            */
                            JP_NOP,                                     /*  本架拉后溜                  */
                            JP_L,                                       /*  本架推溜                    */
                            JP_7,                                       /*  本架伸侧护                  */
                            JP_NOP,                                     /*  放煤喷雾                    */
                            JP_NOP,                                     /*  顶梁喷雾                    */
                            JP_NOP,                                     /*  机道喷雾                    */
                            JP_NOP,                                     /*  升尾柱                      */
                            JP_NOP,                                     /*  收尾柱                      */
                            JP_NOP,                                     /*  成组放煤喷雾                */
                            JP_NOP,                                     /*  成组顶梁喷雾                */
                            JP_NOP,                                     /*  成组机道喷雾                */
                            JP_NOP,                                     /*  成组喷雾                    */
                            JP_NOP,                                     /*  工况                        */
                            JP_NOP,                                     /*  护帮板联动控制键            */
                            JP_NOP,                                     /*  成组反冲洗按键              */
                            JP_M,                                     /*  时钟显示快捷按键            */
                            JP_NOP,                                     /*  立柱补压参数快捷键升柱键关联*/
                            JP_A,                                       /*  立柱补压功能快捷键          */
                            JP_NOP,                                     /*  立柱补压功能快捷键-组合键2  */
};

static const INT32U __SuiKeyTblTransition[KEY_MAX] = {                     /*  过渡架键盘定义              */
                            JP_NOP,                                     /*  降柱                        */
                            JP_P,                                       /*  移架                        */
                            JP_NOP,                                     /*  升柱                        */
                            JP_L,                                       /*  推溜                        */
                            JP_NOP,                                     /*  抬底                        */
                            JP_NOP,                                     /*  伸平衡                      */
                            JP_NOP,                                     /*  收平衡                      */
                            JP_E,                                       /*  伸伸缩梁                    */
                            JP_F,                                       /*  收伸缩梁                    */
                            JP_9,                                       /*  伸一级护帮                  */
                            JP_6,                                       /*  收一级护帮                  */
                            JP_NOP,                                     /*  伸二级护帮                  */
                            JP_NOP,                                     /*  收二级护帮                  */
                            JP_NOP,                                     /*  三级护帮板伸                */
                            JP_NOP,                                     /*  三级护帮板收                */                            
                            JP_NOP,                                     /*  喷雾                        */
                            JP_NOP,                                     /*  远程                        */
                            JP_1,                                       /*  左邻架                      */
                            JP_2,                                       /*  右邻架                      */
                            JP_N,                                       /*  启动                        */
                            JP_S,                                       /*  停止                        */
                            JP_4,                                       /*  左成组                      */
                            JP_5,                                       /*  右成组                      */
                            JP_8,                                       /*  收侧护                      */
                            JP_7,                                       /*  伸侧护                      */
                            JP_NOP,                                     /*  收底调                      */
                            JP_L,                                       /*  左翻菜单                    */
                            JP_NOP,                                     /*  伸底调                      */
                            JP_R,                                       /*  右翻菜单                    */
                            JP_H,                                       /*  上翻菜单                    */
                            JP_W,                                       /*  下翻菜单                    */
                            JP_K,                                       /*  加1计数                     */
                            JP_M,                                       /*  减1计数                     */
                            JP_N,                                       /*  确认                        */
                            JP_K,                                       /*  左辅助按键                  */
                            JP_M,                                       /*  右辅助按键                  */
                            JP_B,                                       /*  降前柱                      */
                            JP_A,                                       /*  升前柱                      */
                            JP_NOP,                                     /*  降中柱                      */
                            JP_NOP,                                     /*  升中柱                      */                            
                            JP_D,                                       /*  降后柱                      */
                            JP_C,                                       /*  升后柱                      */
                            JP_NOP,                                     /*  伸尾梁                      */
                            JP_NOP,                                     /*  收尾梁                      */
                            JP_NOP,                                     /*  伸插板                      */
                            JP_NOP,                                     /*  收插板                      */
                            JP_NOP,                                     /*  伸后溜                      */
                            JP_3,                                       /*  拉后溜                      */
                            JP_0,                                       /*  伸前梁                      */
                            JP_R,                                       /*  收前梁                      */
                            JP_NOP,                                     /*  反冲洗1                     */
                            JP_NOP,                                     /*  反冲洗2                     */
                            JP_NOP,                                     /*  伸摆梁                      */
                            JP_NOP,                                     /*  收摆梁                      */
                            JP_L,                                       /*  成组推溜                    */
                            JP_P,                                       /*  成组拉溜                    */
                            JP_9,                                       /*  成组一级护帮板伸            */
                            JP_6,                                       /*  成组一级护帮板收            */
                            JP_NOP,                                     /*  成组二级护帮板伸            */
                            JP_NOP,                                     /*  成组二级护帮板收            */
                            JP_NOP,                                     /*  成组前梁伸                  */
                            JP_NOP,                                     /*  成组前梁收                  */
                            JP_NOP,                                     /*  成组拉后溜                  */
                            JP_E,                                       /*  成组伸伸缩梁                */
                            JP_F,                                       /*  成组收伸缩梁                */
                            JP_NOP,                                     /*  成组三级护帮板伸            */
                            JP_NOP,                                     /*  成组三级护帮板收            */
                            JP_3,                                       /*  本架拉后溜                  */
                            JP_L,                                       /*  本架推溜                    */
                            JP_NOP,                                     /*  本架伸侧护                  */
                            JP_NOP,                                     /*  放煤喷雾                    */
                            JP_NOP,                                     /*  顶梁喷雾                    */
                            JP_NOP,                                     /*  机道喷雾                    */
                            JP_NOP,                                     /*  升尾柱                      */
                            JP_NOP,                                     /*  收尾柱                      */
                            JP_NOP,                                     /*  成组放煤喷雾                */
                            JP_NOP,                                     /*  成组顶梁喷雾                */
                            JP_NOP,                                     /*  成组机道喷雾                */
                            JP_NOP,                                     /*  成组喷雾                    */
                            JP_NOP,                                     /*  工况                        */
                            JP_NOP,                                     /*  护帮板联动控制键            */
                            JP_NOP,                                     /*  成组反冲洗按键              */
                            JP_M,                                     /*  时钟显示快捷键              */
                            JP_NOP,                                     /*  立柱补压参数快捷键          */
                            JP_A,     	                                /*  立柱补压功能快捷键-组合键1  */ 
                            JP_NOP,                                     /*  立柱补压功能快捷键-组合键2  */ 
};
static const INT32U __SuiKeyTblEnd[KEY_MAX] = {                      /*  端头架键盘定义              */
                            JP_NOP,                                     /*  降柱                        */
                            JP_0,                                       /*  移架                        */
                            JP_NOP,                                     /*  升柱                        */
                            JP_F,                                       /*  推溜                        */
                            JP_NOP,                                     /*  抬底                        */
                            JP_NOP,                                     /*  伸平衡                      */
                            JP_NOP,                                     /*  收平衡                      */
                            JP_NOP,                                     /*  伸伸缩梁                    */
                            JP_NOP,                                     /*  收伸缩梁                    */
                            JP_NOP,                                     /*  伸一级护帮                  */
                            JP_NOP,                                     /*  收一级护帮                  */
                            JP_NOP,                                     /*  伸二级护帮                  */
                            JP_NOP,                                     /*  收二级护帮                  */
                            JP_NOP,                                     /*  三级护帮板伸                */
                            JP_NOP,                                     /*  三级护帮板收                */                            
                            JP_NOP,                                     /*  喷雾                        */
                            JP_NOP,                                     /*  远程                        */
                            JP_1,                                       /*  左邻架                      */
                            JP_2,                                       /*  右邻架                      */
                            JP_N,                                       /*  启动                        */
                            JP_S,                                       /*  停止                        */
                            JP_4,                                       /*  左成组                      */
                            JP_5,                                       /*  右成组                      */
                            JP_NOP,                                     /*  收侧护                      */
                            JP_NOP,                                     /*  伸侧护                      */
                            JP_6,                                       /*  收底调                      */
                            JP_L,                                       /*  左翻菜单                    */
                            JP_9,                                       /*  伸底调                      */
                            JP_R,                                       /*  右翻菜单                    */
                            JP_H,                                       /*  上翻菜单                    */
                            JP_W,                                       /*  下翻菜单                    */
                            JP_K,                                       /*  加1计数                     */
                            JP_M,                                       /*  减1计数                     */
                            JP_N,                                       /*  确认                        */
                            JP_K,                                       /*  左辅助按键                  */
                            JP_M,                                       /*  右辅助按键                  */
                            JP_P,                                       /*  降前柱                      */
                            JP_A,                                       /*  升前柱                      */
                            JP_D,                                       /*  降中柱                      */
                            JP_C,                                       /*  升中柱                      */                             
                            JP_F,                                       /*  降后柱                      */
                            JP_E,                                       /*  升后柱                      */
                            JP_NOP,                                     /*  伸尾梁                      */
                            JP_NOP,                                     /*  收尾梁                      */
                            JP_NOP,                                     /*  伸插板                      */
                            JP_NOP,                                     /*  收插板                      */
                            JP_NOP,                                     /*  伸后溜                      */
                            JP_NOP,                                     /*  拉后溜                      */
                            JP_NOP,                                     /*  伸前梁                      */
                            JP_NOP,                                     /*  收前梁                      */
                            JP_NOP,                                     /*  反冲洗1                     */
                            JP_NOP,                                     /*  反冲洗2                     */
                            JP_NOP,                                     /*  伸摆梁                      */
                            JP_NOP,                                     /*  收摆梁                      */
                            JP_F,                                       /*  成组推溜                    */
                            JP_0,                                       /*  成组拉溜                    */
                            JP_NOP,                                     /*  成组一级护帮板伸            */
                            JP_NOP,                                     /*  成组一级护帮板收            */
                            JP_NOP,                                     /*  成组二级护帮板伸            */
                            JP_NOP,                                     /*  成组二级护帮板收            */
                            JP_NOP,                                     /*  成组前梁伸                  */
                            JP_NOP,                                     /*  成组前梁收                  */
                            JP_NOP,                                     /*  成组拉后溜                  */
                            JP_NOP,                                     /*  成组伸伸缩梁                */
                            JP_NOP,                                     /*  成组收伸缩梁                */
                            JP_NOP,                                     /*  成组三级护帮板伸            */
                            JP_NOP,                                     /*  成组三级护帮板收            */
                            JP_NOP,                                     /*  本架拉后溜                  */
                            JP_F,                                       /*  本架推溜                    */
                            JP_NOP,                                     /*  本架伸侧护                  */
                            JP_NOP,                                     /*  放煤喷雾                    */
                            JP_NOP,                                     /*  顶梁喷雾                    */
                            JP_NOP,                                     /*  机道喷雾                    */
                            JP_NOP,                                     /*  升尾柱                      */
                            JP_NOP,                                     /*  收尾柱                      */
                            JP_NOP,                                     /*  成组放煤喷雾                */
                            JP_NOP,                                     /*  成组顶梁喷雾                */
                            JP_NOP,                                     /*  成组机道喷雾                */
                            JP_NOP,                                     /*  成组喷雾                    */
                            JP_NOP,                                     /*  工况                        */
                            JP_NOP,                                     /*  护帮板联动控制键            */
                            JP_NOP,                                     /*  成组反冲洗键                */
                            JP_M,                                     /*  时钟显示快捷键              */
                            JP_NOP,                                     /*  立柱补压参数快捷键          */
                            JP_A,                                       /*  立柱补压功能快捷键-组合键1  */ 
                            JP_NOP,                                     /*  立柱补压功能快捷键-组合键2  */
};
#endif


const INT32U GuiUnlockPwd[3] = {JP_1, JP_2, JP_3};

const INT32U *GpuiKeyTbl;


/*********************************************************************************************************
** Function name:       mainDisplay
** Descriptions:        空闲状态显示
** input parameters:    none
** output parameters:   None
** Returned value:      None
*********************************************************************************************************/
void mainDisplay(void) 
{
    INT32U uiHours, uiMinutes, uiSeconds, uiTemp;
    guiClrScr(); 
    //guiPrintf(0, 48, 0,"  电液控制系统  ");   
    guiPrintf(0, 0, 0, "跟机");                             /*  1.显示支架编号及状态        */
    if (Gdp.ucAutoStatus == 0) {                                        /*  跟机状态                    */
        guiPrintf(10 * 8, 0, 0,"[停止]");	
    } else {                                                            /*  非跟机状态                  */
        guiPrintf(8 * 8, 0, 0,"[阶段%2d]", Gdp.ucAutoStatus);	
    }

    uiTemp      = Gds.uiTimeStamp / 60;
    uiSeconds   = Gds.uiTimeStamp % 60;
    uiHours     = uiTemp / 60;
    uiMinutes   = uiTemp % 60;
    
    //guiPrintf(0, 24, 0, "运行时间%02d:%2d:%2d", uiHours, uiMinutes, uiSeconds);

    


    /*
     *  3.显示煤机位置及跟机状态
     */
    if ((Gds.ucShearerPos > Gdp.usGblFaceMax) || (Gds.ucShearerPos < Gdp.usGblFaceMin)) {
        guiPrintf(0, 24, 0, "煤机: ***");
    } else {
        guiPrintf(0, 24, 0, "煤机: %3d", Gds.ucShearerPos);
    }
    if (Gds.ucShearerDir == 1) {
        guiPrintf(10 * 8, 24, 0, "[下行]");
    } else if(Gds.ucShearerDir == 2) {
        guiPrintf(10 * 8, 24, 0, "[上行]");
    } else if(Gds.ucShearerDir == 0) {
        guiPrintf(10 * 8, 24, 0, "[停止]");
    } else if (Gds.ucShearerDir == 0xff) {
        guiPrintf(10 * 8, 24, 0, "[ ** ]");
    }			
 }

/*********************************************************************************************************
** Function name:       keyTblGet
** Descriptions:        键盘上按键动作初始化
** input parameters:    ucNo                    架号
** output parameters:   None
** Returned value:      None
*********************************************************************************************************/
const INT32U *keyTblGet(INT8U ucNo)
{
    INT32U uiKeyToValve = 0;
    const INT32U *puiValveTbl;
    const INT32U *puiKeyTbl;
    if (ucNo >= Gdp.ucMiddleNum1 && ucNo <= Gdp.ucMiddleNum2) {                 /*  中间架                      */            
        puiKeyTbl = __SuiKeyTblBase;
    } else if ((ucNo <= Gdp.ucMiddleNum3 && ucNo >= Gdp.usGblFaceMin) || 
               (ucNo >= Gdp.ucMiddleNum4 && ucNo <= Gdp.usGblFaceMax)) {         /*  端头架                      */        
        puiKeyTbl = __SuiKeyTblBase;
    } else if (ucNo > Gdp.ucMiddleNum3 || ucNo < Gdp.ucMiddleNum4) {            /*  过渡架                      */
        puiKeyTbl = __SuiKeyTblBase;
    } else {                                                            /*  非法架号                    */
        puiKeyTbl = __SuiKeyTblBase;
    }
    return puiKeyTbl;
}
/*********************************************************************************************************
** Function name:       keyToAction
** Descriptions:        将动作转化成相应电磁阀开关量
** input parameters:    uiKeyValue              按下的键值
**                      puiKeyTbl               按键动作表
**                      puiValveTbl             电磁阀口动作表
**                      
** output parameters:   None
** Returned value:      阀驱动标识
*********************************************************************************************************/
INT32U keyToAction(INT32U uiKeyValue, const INT32U *puiKeyTbl, const INT32U *puiValveTbl)
{
    INT32U uiKeyToValve = 0;
    if (puiKeyTbl[KEY_LEG_LOW] & uiKeyValue) {                          /*  降柱                        */
        uiKeyToValve |= puiValveTbl[LEG_LOW];
    }	
    if (puiKeyTbl[KEY_CONV_PULL] & uiKeyValue) {                        /*  移架                        */
        uiKeyToValve |= puiValveTbl[CONV_PULL];
    }
    if (puiKeyTbl[KEY_LEG_SET] & uiKeyValue) {                          /*  升柱                        */
        uiKeyToValve |= puiValveTbl[LEG_SET];
    }	
    if (puiKeyTbl[KEY_CONV_PUSH] & uiKeyValue) {                        /*  推溜                        */
        uiKeyToValve |= puiValveTbl[CONV_PUSH];
    }	
    if (puiKeyTbl[KEY_BASE_LIFT_SET] & uiKeyValue) {                    /*  抬底                        */
        uiKeyToValve |= puiValveTbl[BASE_LIFT_SET];
    }		
    if (puiKeyTbl[KEY_STREB_OUT] & uiKeyValue) {                        /*  伸平衡                      */
        uiKeyToValve |= puiValveTbl[STREB_OUT];
    }    
    if (puiKeyTbl[KEY_STREB_IN] & uiKeyValue){                          /*  收平衡                      */
        uiKeyToValve |= puiValveTbl[STREB_IN];
    }	
    if (puiKeyTbl[KEY_FLIP_OUT] & uiKeyValue) {                         /*  伸伸缩梁                    */
        uiKeyToValve |= puiValveTbl[FLIP_OUT];
    }	
    if (puiKeyTbl[KEY_FLIP_IN] & uiKeyValue) {                          /*  收伸缩梁                    */
        uiKeyToValve |= puiValveTbl[FLIP_IN];
    }	
    if (puiKeyTbl[KEY_STAB_OUT] & uiKeyValue) {                         /*  伸一级护帮                  */
        uiKeyToValve |= puiValveTbl[STAB_OUT];
    }	
    if (puiKeyTbl[KEY_STAB_IN] & uiKeyValue) {                          /*  收一级护帮                  */
        uiKeyToValve |= puiValveTbl[STAB_IN];
    }	
    if (puiKeyTbl[KEY_STAB2_OUT] & uiKeyValue) {                        /*  伸二级护帮                  */
        uiKeyToValve |= puiValveTbl[STAB2_OUT];
    }	
    if (puiKeyTbl[KEY_STAB2_IN] & uiKeyValue) {                         /*  收二级护帮                  */
        uiKeyToValve |= puiValveTbl[STAB2_IN];
    }	
    if (puiKeyTbl[KEY_SPARY_ON] & uiKeyValue) {                         /*  喷雾                        */
        uiKeyToValve |= puiValveTbl[SPARY_ON];
    }
    if (puiKeyTbl[KEY_SIDE_IN] & uiKeyValue) {                          /*  收侧护                      */
        uiKeyToValve |= puiValveTbl[SIDE_IN];
    }	
    if (puiKeyTbl[KEY_SIDE_OUT] & uiKeyValue) {                         /*  伸侧护                      */
        uiKeyToValve |= puiValveTbl[SIDE_OUT];
    }	
    if (puiKeyTbl[KEY_BASE_PUSHER_IN] & uiKeyValue) {                   /*  收底调                      */
        uiKeyToValve |= puiValveTbl[BASE_PUSHER_IN];
    }
    if (puiKeyTbl[KEY_BASE_PUSHER_OUT] & uiKeyValue) {                  /*  伸底调                      */
        uiKeyToValve |= puiValveTbl[BASE_PUSHER_OUT];
    }
    if (puiKeyTbl[KEY_FRT_LEG_LOW] & uiKeyValue) {                      /*  降前立柱（左）              */
        uiKeyToValve |= puiValveTbl[FRT_LEG_LOW];
    }
    if (puiKeyTbl[KEY_FRT_LEG_SET] & uiKeyValue) {                      /*  升前立柱（左）              */
        uiKeyToValve |= puiValveTbl[FRT_LEG_SET];
    } 
    if (puiKeyTbl[KEY_REAR_LEG_LOW] & uiKeyValue) {                     /*  降后立柱（右）              */
        uiKeyToValve |= puiValveTbl[REAR_LEG_LOW];
    }
    if (puiKeyTbl[KEY_REAR_LEG_SET] & uiKeyValue) {                     /*  升后立柱（右）              */
        uiKeyToValve |= puiValveTbl[REAR_LEG_SET];
    }
    if (puiKeyTbl[KEY_TAIL_GIRDER_OUT] & uiKeyValue) {                  /*  伸尾梁                      */
        uiKeyToValve |= puiValveTbl[TAIL_GIRDER_OUT];
    }
    if (puiKeyTbl[KEY_TAIL_GIRDER_IN] & uiKeyValue) {                   /*  收尾梁                      */
        uiKeyToValve |= puiValveTbl[TAIL_GIRDER_IN];
    }
    if (puiKeyTbl[KEY_FLASHBOARD_OUT] & uiKeyValue) {                   /*  伸插板                      */
        uiKeyToValve |= puiValveTbl[FLASHBOARD_OUT];
    }
    if (puiKeyTbl[KEY_FLASHBOARD_IN] & uiKeyValue) {                    /*  收插板                      */
        uiKeyToValve |= puiValveTbl[FLASHBOARD_IN];
    }                        	
    if (puiKeyTbl[KEY_REAR_CONV_PUSH] & uiKeyValue) {                   /*  伸后溜                      */
        uiKeyToValve |= puiValveTbl[REAR_CONV_PUSH];
    }                        	
    if (puiKeyTbl[KEY_CONV_PULL] & uiKeyValue) {                        /*  拉后溜                      */
        uiKeyToValve |= puiValveTbl[REAR_CONV_PULL];
    }                        
    if (puiKeyTbl[KEY_FRT_GIRDER_OUT] & uiKeyValue) {                   /*  伸前梁                      */
        uiKeyToValve |= puiValveTbl[FRT_GIRDER_OUT];
    }                        	
    if (puiKeyTbl[KEY_FRT_GIRDER_IN] & uiKeyValue) {                    /*  收前梁                      */
        uiKeyToValve |= puiValveTbl[FRT_GIRDER_IN];
    }                        	
    if (puiKeyTbl[KEY_FILTRATE_1] & uiKeyValue) {                       /*  反冲洗1                     */
        uiKeyToValve |= puiValveTbl[FILTRATE_1];
    }                        	
    if (puiKeyTbl[KEY_FILTRATE_2] & uiKeyValue) {                       /*  反冲洗2                     */
        uiKeyToValve |= puiValveTbl[FILTRATE_2];
    } 
    if (puiKeyTbl[KEY_FLIRT_OUT] & uiKeyValue) {                        /*  伸摆梁                      */
        uiKeyToValve |= puiValveTbl[FLIRT_OUT];
    }                         	
    if (puiKeyTbl[KEY_FLIRT_IN] & uiKeyValue) {                         /*  收摆梁                      */
        uiKeyToValve |= puiValveTbl[FLIRT_IN];
    }  
    if (puiKeyTbl[KEY_STAB3_OUT] & uiKeyValue) {                        /*  伸三级护帮                  */
        uiKeyToValve |= puiValveTbl[STAB3_OUT];
    }
    if (puiKeyTbl[KEY_STAB3_IN] & uiKeyValue) {                         /*  收三级护帮                  */
        uiKeyToValve |= puiValveTbl[STAB3_IN];
    }         	                       	        
    if (puiKeyTbl[KEY_BSPRAY_ON] & uiKeyValue) {                        /*  放煤喷雾                    */
        uiKeyToValve |= puiValveTbl[BSPARY_ON];
    }    
    if (puiKeyTbl[KEY_ASPRAY_ON] & uiKeyValue) {                        /*  顶梁喷雾                    */
        uiKeyToValve |= puiValveTbl[ASPARY_ON];
    } 
    if (puiKeyTbl[KEY_ESPRAY_ON] & uiKeyValue) {                        /*  机道喷雾                    */
        uiKeyToValve |= puiValveTbl[ESPARY_ON];
    }    
    if (puiKeyTbl[KEY_TAIL_PILLAR_OUT] & uiKeyValue) {                  /*  升尾柱                      */
        uiKeyToValve |= puiValveTbl[TAIL_PILLAR_OUT];
    }
    if (puiKeyTbl[KEY_TAIL_PILLAR_IN] & uiKeyValue) {                   /*  收尾柱                      */
        uiKeyToValve |= puiValveTbl[TAIL_PILLAR_IN];
    }
    if (puiKeyTbl[KEY_STAB_LINKAGE] & uiKeyValue) {                     /*  护帮板联动按键              */
        uiKeyToValve |= puiValveTbl[STAB_LINKAGE];
    }   
    if (puiKeyTbl[KEY_HEAD_RIGHT_UP] & uiKeyValue) {                    /*  头右升                      */
        uiKeyToValve |= puiValveTbl[HEAD_RIGHT_UP];
    }                                               
    if (puiKeyTbl[KEY_HEAD_LEFT_UP] & uiKeyValue) {                     /*  头左升                      */
        uiKeyToValve |= puiValveTbl[HEAD_LEFT_UP];
    }
    if (puiKeyTbl[KEY_HEAD_RIGHT_DOWN] & uiKeyValue) {                  /*  头右降                      */
        uiKeyToValve |= puiValveTbl[HEAD_RIGHT_DOWN];
    }
    if (puiKeyTbl [KEY_HEAD_LEFT_DOWN] & uiKeyValue) {                  /*  头左降                      */
        uiKeyToValve |= puiValveTbl[HEAD_LEFT_DOWN];
    }
    if (puiKeyTbl[KEY_TAIL_LEFT_UP] & uiKeyValue) {                     /*  尾左升                      */
        uiKeyToValve |= puiValveTbl[TAIL_LEFT_UP];
    }                                               
    if (puiKeyTbl[KEY_TAIL_RIGHT_UP] & uiKeyValue) {                    /*  尾右升                      */
        uiKeyToValve |= puiValveTbl[TAIL_RIGHT_UP];
    }
    if (puiKeyTbl[KEY_TAIL_RIGHT_DOWN] & uiKeyValue) {                  /*  尾右降                      */
        uiKeyToValve |= puiValveTbl[TAIL_RIGHT_DOWN];
    }                                           
    if (puiKeyTbl[KEY_LEFT_PUSHER_OUT] & uiKeyValue) {                  /*  左推伸                      */
        uiKeyToValve |= puiValveTbl[LEFT_PUSHER_OUT];
    }                                            
    if (puiKeyTbl[KEY_LEFT_PUSHER_IN] & uiKeyValue) {                   /*  左推收                      */
        uiKeyToValve |= puiValveTbl[LEFT_PUSHER_IN];
    }                                             
    if (puiKeyTbl[KEY_HEAD_LEFT_MOVE] & uiKeyValue) {                   /*  头左移                      */
        uiKeyToValve |= puiValveTbl[HEAD_LEFT_MOVE];
    }                                             
    if (puiKeyTbl[KEY_HEAD_RIGHT_MOVE] & uiKeyValue) {                  /*  头右移                      */
        uiKeyToValve |= puiValveTbl[HEAD_RIGHT_MOVE];
    }                                            
    if (puiKeyTbl[KEY_TAIL_LEFT_MOVE] & uiKeyValue) {                   /*  尾左移                      */
        uiKeyToValve |= puiValveTbl[TAIL_LEFT_MOVE];
    }                                             
    if (puiKeyTbl[KEY_TAIL_RIGHT_MOVE] & uiKeyValue) {                  /*  尾右移                      */
        uiKeyToValve |= puiValveTbl[TAIL_RIGHT_MOVE];
    }                                            
    if (puiKeyTbl[KEY_RIGHT_PUSHER_OUT] & uiKeyValue) {                 /*  右推伸                      */
        uiKeyToValve |= puiValveTbl[RIGHT_PUSHER_OUT];
    }                                           
    if (puiKeyTbl[KEY_RIGHT_PUSHER_IN] & uiKeyValue) {                  /*  右推收                      */
        uiKeyToValve |= puiValveTbl[RIGHT_PUSHER_IN];
    }                                            
    if (puiKeyTbl[KEY_TAIL_LEFT_DOWN] & uiKeyValue) {                   /*  尾左降                      */
        uiKeyToValve |= puiValveTbl[TAIL_LEFT_DOWN];
    }                                             
    if (puiKeyTbl[KEY_PUSHER_OUT] & uiKeyValue) {                       /*  推移伸                      */
        uiKeyToValve |= puiValveTbl[PUSHER_OUT];
    }                                                 
    if (puiKeyTbl[KEY_PUSHER_IN] & uiKeyValue) {                        /*  推移收                      */
        uiKeyToValve |= puiValveTbl[PUSHER_IN];
    }                                                  
    if (puiKeyTbl[KEY_LEFT_FLIP_OUT] & uiKeyValue) {                    /*  左伸缩伸                    */
        uiKeyToValve |= puiValveTbl[LEFT_FLIP_OUT];
    }                                              
    if (puiKeyTbl[KEY_LEFT_FLIP_IN] & uiKeyValue) {                     /*  左伸缩收                    */
        uiKeyToValve |= puiValveTbl[LEFT_FLIP_IN];
    }                                               
    if (puiKeyTbl[KEY_RIGHT_FLIP_OUT] & uiKeyValue) {                   /*  右伸缩伸                    */
        uiKeyToValve |= puiValveTbl[RIGHT_FLIP_OUT];
    }                                             
    if (puiKeyTbl[KEY_RIGHT_FLIP_IN] & uiKeyValue) {                    /*  右伸缩收                    */
        uiKeyToValve |= puiValveTbl[RIGHT_FLIP_IN];
    }                                              
    if (puiKeyTbl[KEY_STRIPE_OUT] & uiKeyValue) {                       /*  挑带伸                      */
        uiKeyToValve |= puiValveTbl[STRIPE_OUT];
    }                                                 
    if (puiKeyTbl[KEY_STRIPE_IN] & uiKeyValue) {                        /*  挑带收                      */
        uiKeyToValve |= puiValveTbl[STRIPE_IN];
    }                                                  
    if (puiKeyTbl[KEY_SIDE_1_OUT] & uiKeyValue) {                       /*  侧一伸                      */
        uiKeyToValve |= puiValveTbl[SIDE_1_OUT];
    }                                                 
    if (puiKeyTbl[KEY_SIDE_1_IN] & uiKeyValue) {                        /*  侧一收                      */
        uiKeyToValve |= puiValveTbl[SIDE_1_IN];
    }                                                  
    if (puiKeyTbl[KEY_SIDE_2_OUT] & uiKeyValue) {                       /*  侧二伸                      */
        uiKeyToValve |= puiValveTbl[SIDE_2_OUT];
    }                                                 
    if (puiKeyTbl[KEY_SIDE_2_IN] & uiKeyValue) {                        /*  侧二收                      */
        uiKeyToValve |= puiValveTbl[SIDE_2_IN];
    }                                                  
    if (puiKeyTbl[KEY_SIDE_3_OUT] & uiKeyValue) {                       /*  侧三伸                      */
        uiKeyToValve |= puiValveTbl[SIDE_3_OUT];
    }	                                                
    if (puiKeyTbl[KEY_SIDE_3_IN] & uiKeyValue) {                        /*  侧三收                      */
        uiKeyToValve |= puiValveTbl[SIDE_3_IN];
    } 
    if (puiKeyTbl[KEY_SIDE_4_OUT] & uiKeyValue) {                       /*  侧四伸                      */
        uiKeyToValve |= puiValveTbl[SIDE_4_OUT];
    }	                                                
    if (puiKeyTbl[KEY_SIDE_4_IN] & uiKeyValue) {                        /*  侧四收                      */
        uiKeyToValve |= puiValveTbl[SIDE_4_IN];
    }                                                    
    return uiKeyToValve;		
}
                      	
/*********************************************************************************************************
** Function name:       keyToNum
** Descriptions:        键盘转数字
** input parameters:    uiKeyCode               键值
** output parameters:   None  
** Returned value:      数字 如无效则返回0x0f,加1键返回0x0a，减1键返回0x0b
*********************************************************************************************************/
INT8U keyToNum(INT32U uiKeyCode)
{
    INT8U ucNum;
    if (uiKeyCode & JP_0) {
        ucNum = 0;
    } else if (uiKeyCode & JP_1) {
        ucNum = 1;
    } else if (uiKeyCode & JP_2) {
        ucNum = 2;
    } else if (uiKeyCode & JP_3) {
        ucNum = 3;
    } else if (uiKeyCode & JP_4) {
        ucNum = 4;
    } else if (uiKeyCode & JP_5) {
        ucNum = 5;
    } else if (uiKeyCode & JP_6) {
        ucNum = 6;
    } else if (uiKeyCode & JP_7) {
        ucNum = 7;
    } else if (uiKeyCode & JP_8) {
        ucNum = 8;
    } else if (uiKeyCode & JP_9) {
        ucNum = 9;
    } else if (uiKeyCode & GpuiKeyTbl[KEY_INC]) {
        ucNum = 0x0a;
    } else if (uiKeyCode & GpuiKeyTbl[KEY_DEC]) {
        ucNum = 0x0b;
    } else {
        ucNum = 0x0f;
    }          
    return ucNum;
}


/*********************************************************************************************************
** Function name:       keyNum
** Descriptions:        按下键个数判断
** input parameters:    uiKeyCode               键值
** output parameters:   None  
** Returned value:      按键个数
*********************************************************************************************************/
INT8U keyNum(INT32U uiKeyCode) 
{
    uint32 i,j;
    uint8 num;
    i = 0;
    j = 1;
    num = 0;
    for (i = 0; i < 32; i++) {     
        if ((uiKeyCode & j) != 0) {
            num ++; 
        }
        j = j << 1; 
    } 
    return num;
}


/*********************************************************************************************************
** Function name:       ledNavi
** Descriptions:        导航灯亮
** input parameters:    uiLedNavi               导航指示灯的位掩码取反
** Returned value:      void
*********************************************************************************************************/
void ledNavi(INT32U uiLedNavi)
{    
    INT8U   ucBuf[6];
    ucBuf[0] = 0x55;
    ucBuf[1] =  uiLedNavi >> 24;
    ucBuf[2] = (uiLedNavi >> 16);
    ucBuf[3] = (uiLedNavi >> 8);
    ucBuf[4] = (uiLedNavi >> 0);
    ucBuf[5] = (ucBuf[0] ^ ucBuf[1] ^ ucBuf[2] ^ ucBuf[3] ^ ucBuf[4]);	
    uartWrite(UART1, ucBuf, 6);   
}
/*********************************************************************************************************
** Function name:       ledComm
** Descriptions:        通信导航灯闪烁
** input parameters:    ucLedNo                 指示灯编号
** Returned value:      void
*********************************************************************************************************/
void ledComm(INT8U ucLedNo)
{
    INT8U   ucBuf[6];
    ucBuf[0] = 0xaa;
    ucBuf[1] = ucLedNo;
    ucBuf[2] = 0x00;
    ucBuf[3] = 0x80;
    ucBuf[4] = 0x00;
    ucBuf[5] = (ucBuf[0] ^ ucBuf[1] ^ ucBuf[2] ^ ucBuf[3] ^ ucBuf[4]);	
    uartWrite(UART1, ucBuf, 6); 
}               

/*********************************************************************************************************
  END FILE
*********************************************************************************************************/


