/****************************************Copyright (c)****************************************************
**                      Beijing Huatai Industrial Equipment Co.,Ltd.
**                                      
**                                 http://www.huatai.com.cn 
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               Master.h
** Latest modified Date:    2021-12-27
** Latest Version:          1.0.0
** Descriptions:            主控菜单项头文件
**
**--------------------------------------------------------------------------------------------------------
** Created by:              超人力霸王
** Created date:            2021-12-27
** Version:                 1.0.0
** Descriptions:            The original version
**--------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
** Version:                 
** Descriptions:            
**
*********************************************************************************************************/
#ifndef __MASTER_H
#define __MASTER_H

#ifdef __cplusplus
extern "C" {
#endif                                                                  /*  __cplusplus                 */


/*********************************************************************************************************
** Function name:           miMasterInit
** Descriptions:            主控菜单项初始化
** input parameters:        none
** output parameters:       none
** Returned value:          none
*********************************************************************************************************/
extern void miMasterInit(void);

/*********************************************************************************************************
** Function name:           miMasterDel
** Descriptions:            主控菜单项卸载
** input parameters:        none
** output parameters:       none
** Returned value:          none
*********************************************************************************************************/
extern void miMasterDel(void);

#ifdef __cplusplus
}
#endif                                                                  /*  __cplusplus                 */

#endif                                                                  /*  __MASTER_H                  */

/*********************************************************************************************************
  END FILE
*********************************************************************************************************/
