/****************************************Copyright (c)****************************************************
**                               
**
**                                
**
**--------------File Info---------------------------------------------------------------------------------
** File name:           FullCANAF.H
** Last modified Date:  2013-08-22
** Last Version:        V1.0
** Descriptions:        该函数库为LPC ARM处理器CAN控制器单元的验收过滤配置，LPC2200 ARM处理器的CAN控制器出
**                      现过两个版本，00版本和01版本，在00版本中，设置验收过滤器1对应CAN1，依次类推；01版
**                      本,0对应CAN1，依次类推。LPC2300系列的CAN控制器版本为01，在设置验收过滤器时请对应
**                      相应硬件版本。
**--------------------------------------------------------------------------------------------------------
** Created by:          
** Created date:        2013-08-22
** Version:             1.0
** Descriptions:        The original version
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
*********************************************************************************************************/

#ifndef __FULLCANAF_H
#define __FULLCANAF_H
#ifdef __cplusplus
extern "C" {
#endif                                                                  /*  __cplusplus                */

/*********************************************************************************************************
  验收过滤模式
*********************************************************************************************************/
#define AF_MOD_BP           0x00                                        /*  旁路模式                    */
#define AF_MOD_ON           0x01                                        /*  使能模式                    */
#define AF_MOD_OFF          0x02                                        /*  关闭模式                    */
/*********************************************************************************************************
   验收过滤错码
*********************************************************************************************************/
#define AF_LUT_SETTING_OK   0                                           /*  验收表格设置正确            */
#define AF_SIZE_TOO_LARGE   1                                           /*  设置的验收过滤表格超过范围  */
#define AF_MEM_MALLOC_ERR   2                                           /*  系统分配内存错误            */
#define AF_PARA_ERR         3                                           /*  参数错误                    */

struct canaftab {                                                       /*  验收滤波表格结构体定义      */
    uint16     *pusSigSFTab;                                            /*  标准帧验收滤波离散表格指针  */
    uint32      uiSSFTabLen;                                            /*  标准帧验收滤波离散表格长度  */

    ulint32    *puiGrpSFTab;                                            /*  标准帧验收滤波范围表格指针  */
    uint32      uiGSFTabLen;                                            /*  标准帧验收滤波范围表格长度  */

    ulint32    *puiSigEFTab;                                            /*  扩展帧验收滤波离散表格指针  */
    uint32      uiSEFTabLen;                                            /*  扩展帧验收滤波离散表格长度  */

    ulint64    *pullGrpEFTab;                                           /*  扩展帧验收滤波范围表格指针  */
    uint32      uiGEFTabLen;                                            /*  扩展帧验收滤波范围表格长度  */
   
    void        (*pReceive)(void *pRsv,CANFRAME ucfRbr);                /*  接收到CAN帧调用的函数       */
                                                                        /*  pRsv:   保留,用户不要操作   */
                                                                        /*  ucfRbr: 接收到的CAN帧       */
};
typedef struct canaftab     CANAFTAB;                                   /*  定义CAN验收滤波表格数据类型 */

/*********************************************************************************************************
    LPC CAN控制器验收滤波通道定义
*********************************************************************************************************/
enum LPC_AF_CANCH {AF_CH1=0, AF_CH2};

/*********************************************************************************************************
    CAN验收滤波表格元素格式及填充宏定义
*********************************************************************************************************/
#define AF_SSF(CH, SF)          (((CH) << 13) | ((SF) & 0x7FF))         /*  标准帧验收过滤离散表格数据  */
                                                                        /*  16位宽                      */
#define AF_GSF(CH, LWSF, UPSF)  (((AF_SSF(CH, LWSF)) << 16) | AF_SSF(CH, UPSF))
                                                                        /*  标准帧验收过滤范围表格数据  */
                                                                        /*  32位宽                      */
#define AF_SEF(CH, EF)          (((CH) << 29) | ((EF) & 0x1FFFFFFF))    /*  扩展帧验收过滤离散表格数据  */
                                                                        /*  32位宽                      */
#define AF_GEF(CH, LWEF, UPEF)  ((((ulint64)AF_SEF(CH, LWEF)) << 32) | AF_SEF(CH, UPEF))
 
/*********************************************************************************************************
** Function name:           AFSetMode
**
** Descriptions:            本函数用于配置验收过滤器模式
**
** input parameters:        nMod    ->  AF_MOD_OFF  关闭模式,任何帧都不接收
**                                  ->  AF_MOD_BP   旁路模式,任何帧都接收
**                                  ->  AF_MOD_ON   使能模式,根据表格设置接收
** Returned value:          none
*********************************************************************************************************/
extern void AFSetMode(INT8U ucMode);


/*********************************************************************************************************  
** Function name:           canAfSet  
** Descriptions:            
** input parameters:        pci:        can接口数据结构指针         
**                          
**                            
** Output parameters:       none       
** Returned value:          AF_LUT_SETTING_OK   ->  验收表格设置正确
**                          AF_SIZE_TOO_LARGE   ->  设置的验收过滤表格超过范围
**                          AF_MEM_MALLOC_ERR   ->  系统内存分配错误       
**                          
** Example:                    
**                            
*********************************************************************************************************/
extern unsigned char canAfSet(CANAFTAB *pAfTab);

#ifdef __cplusplus
    }
#endif                                                                  /*  __cplusplus                 */
#endif                                                                  /*  _FullCANAF_H                */
/*********************************************************************************************************
  END FILE
*********************************************************************************************************/