/****************************************Copyright (c)****************************************************
**                  
**                                      
**                                 
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               tp_UpDataEnd.h
** Latest modified Date:    2014-08-25
** Latest Version:          1.0
** Descriptions:            端口驱动头文件
**
**--------------------------------------------------------------------------------------------------------
** Created by:              
** Created date:            2014-08-25
** Version:                 1.0
** Descriptions:            The original version
**
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************/
#ifndef __TP_UPDATA_END_H
#define __TP_UPDATA_END_H

#ifdef __cplusplus
extern "C" {
#endif                                                                  /*  __cplusplus                 */


/*********************************************************************************************************
  以下可添加一些宏定义
*********************************************************************************************************/
    /*
     *  内部Flash升级 -- 下载管理程序
     */
    
#define	__PARAM_ADDR0		    0x00002000								/*  参数首地址					*/
#define	__PARAM_ADDR1		    0x00004000								/*  参数首地址					*/
   
    /*
     *  外部Flash升级 -- 应用程序
     */
#define	__PARAM_ADDR_EX0        0x80100000								/*  参数首地址(256)             */
#define	__PARAM_ADDR_EX1        0x80101000								/*  参数首地址(257)             */
    /*
     *  外部智能设备升级 
     */
#define	__PARAM_ADDR_EX2        0x80102000								/*  参数首地址(258)             */
#define	__PARAM_ADDR_EX3        0x80103000								/*  参数首地址(259)             */
/*********************************************************************************************************
  功能部件信息
*********************************************************************************************************/
struct tp_UpDataEnd_info {
    TM_PORT_INFO tmPort;                                                /*  功能部件基本信息            */
    /*
     *  此驱动需要附加的信息
     */        
};

typedef  struct tp_UpDataEnd_info  TP_UPDATA_END_INFO;


typedef struct __param_struct {

    INT32U  uiCodeVer;                                                  /*  版本号                      */
    INT32U  uiCodeLen;                                                  /*  长度                        */
    INT32U  uiCodeId;                                                   /*  ID                          */
    INT32U  uiFlag[3];                                                 /*  保留区域                    */
    INT32U  uiCodeVerRsv;                                               /*  版本号，中间记录            */
    INT32U  uiCodeLenRsv1;                                              /*  长度，中间记录              */
    INT32U  uiCodeLenRsv;                                               /*  已接收长度，中间记录        */
    INT32U  uiCodeIdRsv;                                                /*  ID，中间记录                */
    INT32U  uiFlagRsv[4];                                              /*  保留区域                    */
    INT32U  uiFlag1;                                                    /*  标志1，0x11223344           */
    INT32U  uiFlagRsv1[4];                                              /*  保留区域                    */
    INT32U  uiFlag2;                                                    /*  标志2，0xaa55aa55           */
    INT32U  uiFlagRsv2[4];                                              /*  保留区域                    */
    INT32U  uiFlag3;                                                    /*  标志3，0x44332211           */
    INT32U  uiFlagRsv3[4];                                              /*  保留区域                    */
    INT32U  uiFlag4;                                                    /*  标志4，0x55aa55aa           */
    INT32U  uiFlagRsv4[4];                                              /*  保留区域                    */
} __PARAM_STRUCT, *__pPARAM_STRUCT;

   
/*********************************************************************************************************
  提供的全局变量
*********************************************************************************************************/
extern const TM_PORT_FUNC GtpfUpDataEnd;                                /*  设备接口函数表              */



#ifdef __cplusplus
}
#endif                                                                  /*  __cplusplus                 */
#endif                                                                  /*  __TP_UPDATA_END_H           */

/*********************************************************************************************************
  END FILE
*********************************************************************************************************/
